
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>01 - EeePCとEmacsと私と · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >01 - EeePCとEmacsと私と</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="01---eeepc&#x3068;emacs&#x3068;&#x79C1;&#x3068;">01 - EeePC&#x3068;Emacs&#x3068;&#x79C1;&#x3068;</h1>
<p>&#x4F55;&#x304B;&#x76EE;&#x7684;&#x304C;&#x3042;&#x3063;&#x305F;&#x308F;&#x3051;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x4F55;&#x304B;&#x3058;&#x3063;&#x3068;&#x3057;&#x3066;&#x3044;&#x3089;&#x308C;&#x306A;&#x3044;&#x3053;&#x3068;&#x304C;&#x3042;&#x3063;&#x305F;&#x306E;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x79C1;&#x306F;&#x57C3;&#x3092;&#x304B;&#x3076;&#x3063;&#x305F;EeePC&#x306E;&#x5929;&#x677F;&#x3092;&#x62ED;&#x304F;&#x3068;&#xFF0C;&#x30B9;&#x30A4;&#x30C3;&#x30C1;&#x3092;&#x5165;&#x308C;&#x305F;&#x3002;  </p>
<p>10.1&#x30A4;&#x30F3;&#x30C1;&#x306E;&#x30E2;&#x30CB;&#x30BF;&#x306B;EeePC&#x306E;&#x7C97;&#x3044;&#x30ED;&#x30B4;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x305F;&#x3042;&#x3068;&#xFF0C;HDD&#x306E;&#x30AC;&#x30EA;&#x30AC;&#x30EA;&#x3044;&#x3046;&#x97F3;&#x304C;&#x3042;&#x3063;&#x3066;&#xFF0C;Lubuntu&#x306E;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x753B;&#x9762;&#x304C;&#x3042;&#x3089;&#x308F;&#x308C;&#x305F;&#x3002;EeePC&#x306F;&#x76EE;&#x3092;&#x899A;&#x307E;&#x3059;&#x3068;&#xFF0C;&#x79C1;&#x306E;&#x9854;&#x3092;&#x898B;&#x3066;&#x5C11;&#x3057;&#x9A5A;&#x3044;&#x305F;&#x3088;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;&#x5F53;&#x7136;&#x3060;&#x3002;&#x4EE5;&#x524D;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x306E;&#x304C;&#x3044;&#x3064;&#x304B;&#x3055;&#x3048;&#x899A;&#x3048;&#x3066;&#x3044;&#x306A;&#x3044;&#x306E;&#x3060;&#x304B;&#x3089;&#x3002;  </p>
<p>EeePC&#x306F;&#x79C1;&#x304C;&#x8A71;&#x3057;&#x304B;&#x3051;&#x306A;&#x3044;&#x304B;&#x304E;&#x308A;&#x3082;&#x306E;&#x3092;&#x8A00;&#x3046;&#x3053;&#x3068;&#x306F;&#x306A;&#x3044;&#x3002;&#x305F;&#x3060;&#xFF0C;&#x8CA0;&#x62C5;&#x3092;&#x304B;&#x3051;&#x308B;&#x3068;&#xFF0C;&#x305F;&#x3060;&#x3067;&#x3055;&#x3048;&#x8033;&#x969C;&#x308A;&#x306A;&#x30D5;&#x30A1;&#x30F3;&#x304C;&#x4F59;&#x8A08;&#x306B;&#x5927;&#x304D;&#x306A;&#x97F3;&#x3092;&#x305F;&#x3066;&#x308B;&#x3002;&#x3053;&#x306E;&#x3054;&#x6642;&#x4E16;&#xFF0C;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x3092;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x3082;&#x4E00;&#x82E6;&#x52B4;&#x3067;&#xFF0C;&#x305C;&#x3048;&#x305C;&#x3048;&#x8352;&#x3044;&#x606F;&#x3092;&#x3064;&#x304D;&#x306A;&#x304C;&#x3089;&#x3082;&#x61F8;&#x547D;&#x306B;&#x79C1;&#x306E;&#x64CD;&#x4F5C;&#x306B;&#x5F93;&#x3046;&#x306E;&#x3060;&#x3002;&#x6642;&#x4EE3;&#x9045;&#x308C;&#x306E;&#x30DD;&#x30F3;&#x30B3;&#x30C4;&#x3067;&#x3042;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x306D;&#x3048;&#x300D;&#x79C1;&#x306F;&#x3075;&#x3068;EeePC&#x306B;&#x5C0B;&#x306D;&#x3066;&#x307F;&#x305F;&#x3002;&#x300C;&#x2026;&#x4F55;&#x3060;&#x300D;&#x4E45;&#x3057;&#x304F;&#x58F0;&#x3092;&#x767A;&#x3057;&#x3066;&#x3044;&#x306A;&#x304B;&#x3063;&#x305F;EeePC&#x306F;&#xFF0C;&#x305F;&#x3081;&#x3089;&#x3044;&#x304C;&#x3061;&#x306B;&#x5C0F;&#x3055;&#x304F;&#x7B54;&#x3048;&#x308B;&#x3002;&#x300C;&#x541B;&#x306E;&#x89E3;&#x50CF;&#x5EA6;&#x306F;&#x3044;&#x304F;&#x3064;&#x3060;&#x3063;&#x305F;&#x3063;&#x3051;&#xFF1F;&#x300D;&#x300C;1024x600&#x3057;&#x304B;&#x306A;&#x3044;&#x300D;&#x300C;CPU&#x306F;&#xFF1F;&#x300D;&#x300C;Atom N270 1.6GHz&#x300D;&#x300C;&#x30E1;&#x30E2;&#x30EA;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x305F;&#x3063;&#x305F;1GB&#x3060;&#x300D;&#x300C;HDD&#x306E;&#x5BB9;&#x91CF;&#x306F;&#xFF1F;&#x300D;&#x300C;160GB&#x3042;&#x308B;&#x300D;&#x300C;&#x30C1;&#x30C3;&#x30D7;&#x30BB;&#x30C3;&#x30C8;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x3048;&#x3048;&#x3068;&#x2026;Intel 945GSE&#x3060;&#x3063;&#x305F;&#x304B;&#x306A;&#x3002;&#x52D5;&#x753B;&#x306E;&#x518D;&#x751F;&#x652F;&#x63F4;&#x306F;&#x306A;&#x3044;&#x300D;&#x300C;&#x305D;&#x308C;&#x3067;&#x5F53;&#x6642;&#x3044;&#x304F;&#x3089;&#x3060;&#x3063;&#x305F;&#x3063;&#x3051;&#xFF1F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x306A;&#x2026;5&#x4E07;&#x5186;&#x4EE5;&#x4E0A;&#x306F;&#x3057;&#x305F;&#x3068;&#x601D;&#x3046;&#x300D;  </p>
<p>&#x305D;&#x3046;&#x3060;&#x3002;&#x4ECA;&#x306A;&#x3089;&#x540C;&#x3058;&#x91D1;&#x984D;&#x3067;&#x3053;&#x306E;&#x4F55;&#x500D;&#xFF0C;&#x5834;&#x5408;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;10&#x500D;&#x4EE5;&#x4E0A;&#x306E;&#x6027;&#x80FD;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3060;&#x3063;&#x3066;&#x8CB7;&#x3048;&#x308B;&#x306E;&#x3060;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x3067;&#xFF0C;&#x3069;&#x3046;&#x3057;&#x3066;&#x4ECA;&#x3055;&#x3089;&#x79C1;&#x3092;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x306E;&#x3060;&#x3002;&#x541B;&#x306B;&#x306F;&#x3082;&#x3063;&#x3068;&#x3044;&#x3044;&#x6027;&#x80FD;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x304C;&#x3044;&#x304F;&#x3089;&#x3067;&#x3082;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p>&#x306A;&#x305C;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x306E;&#x3060;&#x308D;&#x3046;&#x3002;&#x3082;&#x306F;&#x3084;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x3067;&#x3055;&#x3048;&#x3064;&#x3089;&#x3044;&#x30DD;&#x30F3;&#x30B3;&#x30C4;&#x3067;&#xFF0C;&#x305D;&#x3053;&#x3089;&#x306E;&#x30B9;&#x30DE;&#x30DB;&#x306B;&#x3055;&#x3048;&#x3082;&#x306F;&#x308B;&#x304B;&#x306B;&#x52A3;&#x308B;&#x6027;&#x80FD;&#x306A;&#x306E;&#x306B;&#x3002;&#x3057;&#x304B;&#x3082;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x3044;&#x3066;&#x6D88;&#x8CBB;&#x96FB;&#x529B;&#x306F;&#x30B9;&#x30DE;&#x30DB;&#x3088;&#x308A;&#x5927;&#x304D;&#x3044;&#x306E;&#x3060;&#x3002;&#x3072;&#x3069;&#x3044;&#x3082;&#x3093;&#x3060;&#x3002;&#x3060;&#x3063;&#x3066;&#x3053;&#x308C;&#x306F;&#x521D;&#x4EE3;iPhone&#x306E;&#x6642;&#x4EE3;&#xFF0C;&#x6B63;&#x78BA;&#x306B;&#x306F;3G&#x3042;&#x305F;&#x308A;&#x306E;&#x6642;&#x4EE3;&#x306E;&#x3082;&#x306E;&#x306A;&#x306E;&#x3060;&#x304B;&#x3089;&#x3002;&#x3053;&#x306E;&#x4E16;&#x754C;&#x3067;&#x306F;&#x9AA8;&#x8463;&#x54C1;&#x30EC;&#x30D9;&#x30EB;&#x306E;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;&#x5927;&#x4E8B;&#x306B;&#x306A;&#x3059;&#x3063;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#xFF0C;&#x3068;&#x8A00;&#x308F;&#x308C;&#x308B;&#x3053;&#x3068;&#x306F;&#x3042;&#x3063;&#x3066;&#x3082;&#xFF0C;&#x73FE;&#x5F79;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x306A;&#x3093;&#x3066;&#x5230;&#x5E95;&#x8003;&#x3048;&#x3089;&#x308C;&#x306A;&#x3044;&#x3082;&#x306E;&#x3060;&#x3002;  </p>
<p>&#x305F;&#x3060;&#x79C1;&#x306B;&#x306F;&#x3044;&#x304F;&#x3064;&#x3082;&#x306E;&#x5FD8;&#x308C;&#x3089;&#x308C;&#x306A;&#x3044;&#x601D;&#x3044;&#x51FA;&#x304C;&#x3042;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x306D;&#x3048;&#xFF0C;&#x899A;&#x3048;&#x3066;&#x308B;&#xFF1F;&#x6614;&#xFF0C;&#x79C1;&#x304C;&#x3072;&#x3069;&#x3044;&#x3081;&#x306B;&#x3042;&#x3063;&#x3066;&#xFF0C;&#x30DB;&#x30C6;&#x30EB;&#x3067;&#x3081;&#x305D;&#x3081;&#x305D;&#x3057;&#x3066;&#x3044;&#x305F;&#x3068;&#x304D;&#x300D;&#x300C;&#x3042;&#x3042;&#x3002;&#x79C1;&#x304C;&#x541B;&#x306B;&#x8CB7;&#x308F;&#x308C;&#x3066;&#x3069;&#x308C;&#x304F;&#x3089;&#x3044;&#x3060;&#x3063;&#x305F;&#x304B;&#x3002;&#x30AB;&#x30D0;&#x30F3;&#x304B;&#x3089;&#x51FA;&#x3057;&#x305F;&#x79C1;&#x3092;&#x898B;&#x3066;&#x305A;&#x3063;&#x3068;&#x60B2;&#x3057;&#x305D;&#x3046;&#x306A;&#x9854;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3089;&#xFF0C;youtube&#x3067;&#x3072;&#x305F;&#x3059;&#x3089;&#x52D5;&#x753B;&#x3092;&#x6D41;&#x3057;&#x3066;&#x306A;&#x3093;&#x3068;&#x304B;&#x541B;&#x3092;&#x306A;&#x3050;&#x3055;&#x3081;&#x3088;&#x3046;&#x3068;&#x3057;&#x305F;&#x300D;  </p>
<p>&#x300C;&#x79C1;&#x304C;&#x521D;&#x3081;&#x3066;&#x6D77;&#x5916;&#x306B;&#x884C;&#x3063;&#x305F;&#x3068;&#x304D;&#x306F;&#xFF1F;&#x300D;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x899A;&#x3048;&#x3066;&#x3044;&#x308B;&#x3002;&#x541B;&#x306F;&#x305A;&#x3063;&#x3068;&#x7DF4;&#x7FD2;&#x3092;&#x3057;&#x3066;&#x3044;&#x305F;&#x3002;&#x98DB;&#x884C;&#x6A5F;&#x306E;&#x4E2D;&#x3067;&#x3082;&#x601D;&#x3044;&#x51FA;&#x3057;&#x305F;&#x3088;&#x3046;&#x306B;&#x79C1;&#x3092;&#x3068;&#x308A;&#x3060;&#x3057;&#x3066;&#xFF0C;&#x7121;&#x8A00;&#x3067;&#x53E3;&#x3092;&#x52D5;&#x304B;&#x3057;&#x3066;&#x3044;&#x305F;&#x306A;&#x3002;&#x90E8;&#x5C4B;&#x306B;&#x3064;&#x3044;&#x3066;&#x304B;&#x3089;&#x3082;&#xFF0C;&#x79C1;&#x306E;&#x5C0F;&#x3055;&#x3044;&#x753B;&#x9762;&#x3067;&#x541B;&#x306F;&#x591C;&#x9045;&#x304F;&#x307E;&#x3067;&#x7DF4;&#x7FD2;&#x3092;&#x3057;&#x3066;&#x3044;&#x305F;&#x3002;&#x541B;&#x306B;&#x3064;&#x3044;&#x3066;&#x3044;&#x304F;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x304B;&#x3063;&#x305F;&#x304C;&#xFF0C;&#x5E30;&#x3063;&#x3066;&#x304D;&#x305F;&#x541B;&#x3092;&#x898B;&#x3066;&#x6210;&#x529F;&#x3092;&#x78BA;&#x4FE1;&#x3057;&#x305F;&#x3088;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x304B;&#x3089;&#x3082;&#x3044;&#x308D;&#x3093;&#x306A;&#x3068;&#x3053;&#x308D;&#x306B;&#x884C;&#x3063;&#x305F;&#x306D;&#x300D;&#x300C;&#x3042;&#x3042;&#x3002;&#x79C1;&#x306F;&#x9811;&#x4E08;&#x3055;&#x3060;&#x3051;&#x304C;&#x3068;&#x308A;&#x3048;&#x3060;&#x3063;&#x305F;&#x304B;&#x3089;&#x306A;&#x300D;&#x300C;&#x30B9;&#x30FC;&#x30C4;&#x30B1;&#x30FC;&#x30B9;&#x3068;&#x304B;&#x30DC;&#x30B9;&#x30C8;&#x30F3;&#x30D0;&#x30C3;&#x30B0;&#x306B;&#x30AE;&#x30C1;&#x30AE;&#x30C1;&#x306E;&#x3068;&#x3053;&#x308D;&#x306B;&#x5165;&#x308C;&#x305F;&#x304B;&#x3089;&#xFF0C;&#x58CA;&#x308C;&#x306A;&#x3044;&#x304B;&#x3044;&#x3064;&#x3082;&#x5FC3;&#x914D;&#x3067;&#x300D;&#x300C;&#x541B;&#x306F;&#x8377;&#x7269;&#x304C;&#x591A;&#x904E;&#x304E;&#x308B;&#x3093;&#x3060;&#x3002;&#x5FC3;&#x914D;&#x6027;&#x306A;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x3067;&#x3082;&#x541B;&#x306F;&#x58CA;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x3002;&#x541B;&#x304C;&#x79C1;&#x3092;&#x4FE1;&#x3058;&#x308B;&#x304B;&#x304E;&#x308A;&#xFF0C;&#x79C1;&#x306F;&#x541B;&#x306B;&#x5FDC;&#x3048;&#x308B;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x306F;&#xFF0C;&#x3050;&#x3089;&#x3064;&#x304F;&#x79C1;&#x306E;&#x4E2D;&#x306B;&#x3059;&#x3063;&#x3068;&#x82AF;&#x304C;&#x901A;&#x308B;&#x3088;&#x3046;&#x306A;&#xFF0C;&#x4E0D;&#x601D;&#x8B70;&#x306A;&#x611F;&#x3058;&#x3060;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x541B;&#x306B;&#x306F;USB&#x7AEF;&#x5B50;&#x304C;&#x4E09;&#x3064;&#x3042;&#x308B;&#x306D;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x300D;&#x300C;&#x5916;&#x90E8;&#x30E2;&#x30CB;&#x30BF;&#x306B;&#x51FA;&#x529B;&#x3059;&#x308B;&#x7AEF;&#x5B50;&#x3082;&#x3042;&#x308B;&#x300D;&#x300C;&#x30A2;&#x30CA;&#x30ED;&#x30B0;&#x3060;&#x304C;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x3060;&#x304B;&#x3089;&#x79C1;&#x306F;&#x6C7A;&#x3081;&#x305F;&#x300D;&#x300C;&#x4F55;&#x3092;&#xFF1F;&#x300D;&#x300C;&#x541B;&#x3092;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F7F;&#x304A;&#x3046;&#x3068;&#x601D;&#x3046;&#x300D;&#x300C;&#x3075;&#x3080;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x69CB;&#x308F;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x3069;&#x3046;&#x3059;&#x308B;&#x3093;&#x3060;&#x3002;&#x79C1;&#x306B;&#x306F;&#x3082;&#x306F;&#x3084;&#x524D;&#x7DDA;&#x3067;&#x6226;&#x3046;&#x3060;&#x3051;&#x306E;&#x529B;&#x306F;&#x306A;&#x3044;&#x3002;&#x767A;&#x58F2;&#x3055;&#x308C;&#x305F;&#x5F53;&#x6642;&#x3067;&#x3055;&#x3048;&#xFF0C;&#x6642;&#x4EE3;&#x9045;&#x308C;&#x306E;&#x6027;&#x80FD;&#x3068;&#x304B;&#x3089;&#x304B;&#x308F;&#x308C;&#x305F;&#x306E;&#x3060;&#x3002;&#x30D7;&#x30EA;&#x30F3;&#x30BF;&#x30B5;&#x30FC;&#x30D0;&#x3084;&#x30EB;&#x30FC;&#x30BF;&#x306B;&#x3067;&#x3082;&#x3059;&#x308B;&#x3064;&#x3082;&#x308A;&#x304B;&#x300D;&#x300C;&#x79C1;&#x306F;&#x541B;&#x3092;&#x73FE;&#x5F79;&#x306B;&#x5FA9;&#x5E30;&#x3055;&#x305B;&#x308B;&#x3002;10&#x5E74;&#x524D;&#x306E;&#x30B9;&#x30DE;&#x30DB;&#x306B;&#x306F;&#x7121;&#x7406;&#x3067;&#x3082;&#xFF0C;&#x541B;&#x306A;&#x3089;&#x4ECA;&#x3067;&#x3082;&#x5341;&#x5206;&#x306B;&#x6226;&#x3048;&#x308B;&#x3002;&#x3060;&#x3063;&#x3066;&#x79C1;&#x304C;&#x9078;&#x3093;&#x3060;&#x3093;&#x3060;&#x304B;&#x3089;&#x300D;  </p>
<p><br><br>&#x300C;&#x306A;&#x3089;&#x3070;&#x554F;&#x304A;&#x3046;&#x3002;10&#x5E74;&#x524D;&#x306E;&#x30CE;&#x30FC;&#x30C8;PC&#x3067;&#x3042;&#x308B;&#x79C1;&#x3092;&#xFF0C;&#x73FE;&#x5F79;&#x3067;&#x4F7F;&#x3046;&#x3068;&#x3044;&#x3046;&#x541B;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x3092;&#x300D;  </p>
<p><br><br>&#x300C;&#x79C1;&#x306F;&#x541B;&#x3092;&#xFF0C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;&#x3064;&#x3044;&#x305F;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3046;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: EeePCとEmacsと○○と">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="02.html" class="navigation navigation-next " aria-label="Next page: 02 - EeePCとEmacsとLinuxと">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"01 - EeePCとEmacsと私と","level":"1.2","depth":1,"next":{"title":"02 - EeePCとEmacsとLinuxと","level":"1.3","depth":1,"path":"02.md","ref":"02.md","articles":[]},"previous":{"title":"EeePCとEmacsと○○と","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01.md","mtime":"2018-07-28T21:12:52.932Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-05T11:39:57.797Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

