
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>02 - EeePCとEmacsとLinuxと · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="03.html" />
    
    
    <link rel="prev" href="01.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >02 - EeePCとEmacsとLinuxと</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="02---eeepc&#x3068;emacs&#x3068;linux&#x3068;">02 - EeePC&#x3068;Emacs&#x3068;Linux&#x3068;</h1>
<p>&#x305D;&#x308C;&#x304B;&#x3089;&#x79C1;&#x3068;EeePC&#x306F;&#x3069;&#x306E;Linux&#x30C7;&#x30A3;&#x30B9;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x3046;&#x304B;&#x8A66;&#x3057;&#x306F;&#x3058;&#x3081;&#x305F;&#x3002;&#x5F53;&#x305F;&#x308A;&#x524D;&#x3060;&#x304C;Windows&#x306F;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x5207;&#x308C;&#xFF0C;BSD&#x306F;&#x79C1;&#x306E;&#x77E5;&#x8B58;&#x4E0D;&#x8DB3;&#xFF0C;&#x3086;&#x3048;&#x306B;OS&#x306E;&#x9078;&#x629E;&#x80A2;&#x306F;Linux&#xFF0C;&#x4EBA;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;GNU/Linux&#xFF0C;&#x3057;&#x304B;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;&#x3057;&#x304B;&#x3082;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F7F;&#x3046;&#x305F;&#x3081;&#x306B;&#x306F;&#x305D;&#x3053;&#x305D;&#x3053;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x9577;&#x3044;&#x3082;&#x306E;&#x3067;&#x306A;&#x304F;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x305D;&#x3082;&#x305D;&#x3082;&#x79C1;&#x306F;&#x7D20;&#x4EBA;&#x3060;&#x304B;&#x3089;&#x3042;&#x308B;&#x7A0B;&#x5EA6;&#x306E;&#x6A5F;&#x80FD;&#x306F;&#x306F;&#x3058;&#x3081;&#x304B;&#x3089;&#x3064;&#x3044;&#x3066;&#x3044;&#x3066;&#x307B;&#x3057;&#x3044;&#x3002;  </p>
<p>&#x4F55;&#x3088;&#x308A;EeePC&#x306F;&#xFF0C;&#x30CE;&#x30FC;&#x30C8;PC&#x3068;&#x3057;&#x3066;&#x3082;&#x306F;&#x3084;&#x63A1;&#x7528;&#x3055;&#x308C;&#x308B;&#x3053;&#x3068;&#x306F;&#x6C38;&#x4E45;&#x306B;&#x306A;&#x3044;&#x3067;&#x3042;&#x308D;&#x3046;32bit CPU&#x3067;&#x3042;&#x308A;&#xFF0C;Arch Linux&#x306A;&#x3069;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x7D42;&#x3048;&#x305F;&#x3082;&#x306E;&#x3082;&#x73CD;&#x3057;&#x304F;&#x306A;&#x3044;&#x3002;Ubuntu&#x3082;&#x6B21;&#x671F;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;32bit&#x7248;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x306A;&#x3044;&#x3002;&#x521D;&#x3081;&#x304B;&#x3089;&#x5019;&#x88DC;&#x306F;&#x9650;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x3061;&#x306A;&#x307F;&#x306B;&#x79C1;&#x3092;&#x3069;&#x3093;&#x306A;&#x30DE;&#x30B7;&#x30F3;&#x306B;&#x3057;&#x305F;&#x3044;&#x306E;&#x304B;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x306A;&#x76EE;&#x6A19;&#x306F;&#x3042;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;EeePC&#x304C;&#x805E;&#x3044;&#x3066;&#x304D;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x3060;&#x306A;&#x3041;&#x3002;&#x672C;&#x5F53;&#x306F;<a href="https://jp.linux.com/linux-community/30linuxkerneldevelopers/393718-30linux-paul-mundt" target="_blank">Paul Mundt</a>&#x3055;&#x3093;&#x307F;&#x305F;&#x3044;&#x306B;&#x4F7F;&#x3048;&#x308C;&#x3070;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x3093;&#x3060;&#x308D;&#x3046;&#x3051;&#x3069;&#x2026;&#x300D;&#x300C;&#x8AB0;&#x3060;&#xFF0C;&#x305D;&#x306E;&#x5FA1;&#x4EC1;&#x306F;&#x300D;&#x300C;Linux&#x30AB;&#x30FC;&#x30CD;&#x30EB;&#x306E;&#x958B;&#x767A;&#x8005;&#x306A;&#x3093;&#x3060;&#x3051;&#x3069;&#xFF0C;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x672C;&#x5F53;&#x306B;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x300D;  </p>
<blockquote>
<p>fbcon&#x3001;vim&#x3001;mutt&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x3066;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;  </p>
</blockquote>
<p>&#x300C;&#x3069;&#x3053;&#x304C;&#x304B;&#x3063;&#x3053;&#x3044;&#x3044;&#x306E;&#x304B;&#x5168;&#x7136;&#x308F;&#x304B;&#x3089;&#x3093;&#x306E;&#x3060;&#x304C;&#x300D;&#x300C;&#x3048;&#xFF0C;&#x3060;&#x3063;&#x3066;fbcon&#x3060;&#x3088;&#x300D;&#x300C;fbcon&#xFF1F;&#x300D;&#x300C;X&#x3092;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3093;&#x3060;&#x300D;&#x300C;X&#x3092;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3063;&#x3066;&#xFF0C;&#x3042;&#x308C;&#x304B;&#x3002;&#x541B;&#x304C;&#x6614;&#xFF0C;&#x3088;&#x304F;Ctrl+Alt+F2&#x3067;&#x771F;&#x3063;&#x9ED2;&#x306A;&#x753B;&#x9762;&#x306B;&#x843D;&#x3068;&#x3057;&#x3066;&#x3044;&#x305F;&#x304C;&#x300D;&#x300C;&#x305D;&#x3046;&#x3002;&#x305D;&#x308C;&#x305D;&#x308C;&#x300D;&#x300C;&#x305D;&#x308C;&#x3067;&#x3053;&#x306E;&#x5FA1;&#x4EC1;&#x306F;&#x4F5C;&#x696D;&#x3092;&#x3059;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x300D;&#x300C;&#x306A;&#x3089;&#x3070;&#x541B;&#x3082;&#x305D;&#x3046;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x3002;&#x6614;&#x306F;&#x7686;&#x305D;&#x3046;&#x3060;&#x3063;&#x305F;&#x306E;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;&#x300C;&#x3048;&#x30FC;&#xFF0C;pdf&#x3068;&#x304B;&#x753B;&#x50CF;&#x3092;&#x958B;&#x304F;&#x306E;&#x306B;&#x3044;&#x3061;&#x3044;&#x3061;X&#x7ACB;&#x3061;&#x4E0A;&#x3052;&#x308B;&#x306A;&#x3093;&#x3066;&#x9762;&#x5012;&#x3060;&#x3088;&#x3002;&#x30DE;&#x30A6;&#x30B9;&#x3084;GIMP&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x3068;&#x304D;&#x3060;&#x3063;&#x3066;&#x3042;&#x308B;&#x3057;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3080;&#xFF0C;&#x3084;&#x306F;&#x308A;&#x541B;&#x306F;&#x79C1;&#x306A;&#x3093;&#x304B;&#x4F7F;&#x308F;&#x305A;&#x306B;&#x3082;&#x3063;&#x3068;&#x826F;&#x3044;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3092;&#x4F7F;&#x3063;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x3075;&#x3063;&#x3075;&#x3063;&#x3075;&#x3002;&#x306A;&#x305C;&#x541B;&#x3092;&#x9078;&#x3093;&#x3060;&#x306E;&#x304B;&#xFF0C;&#x4ECA;&#x306B;&#x308F;&#x304B;&#x308B;&#x3088;&#x300D;  </p>
<p>&#x305D;&#x3093;&#x306A;&#x4E0B;&#x3089;&#x306A;&#x3044;&#x4F1A;&#x8A71;&#x3092;&#x3057;&#x306A;&#x304C;&#x3089;&#xFF0C;&#x79C1;&#x3068;EeePC&#x306F;Debian&#x30D9;&#x30FC;&#x30B9;&#x306E;Linux&#x3092;&#x6B21;&#x3005;&#x3068;&#x5C0E;&#x5165;&#x3057;&#x3066;&#x306F;&#x305D;&#x306E;&#x4F7F;&#x3044;&#x52DD;&#x624B;&#x3092;&#x78BA;&#x304B;&#x3081;&#x3066;&#x3044;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x541B;&#x306F;&#x79C1;&#x306E;&#x30E1;&#x30E2;&#x30EA;&#x304C;1GB&#x3057;&#x304B;&#x306A;&#x3044;&#x306E;&#x3092;&#x308F;&#x304B;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;&#x300C;&#x3082;&#x3061;&#x308D;&#x3093;&#x300D;&#x300C;&#x305D;&#x308C;&#x306A;&#x3089;LXDE&#x306E;Lubuntu&#x3068;&#x304B;&#xFF0C;Kona Linux light&#x3042;&#x305F;&#x308A;&#x3067;&#x6C7A;&#x307E;&#x308A;&#x3067;&#x306F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x4EE5;&#x524D;&#x306E;&#x79C1;&#x306B;&#x3082;&#x5165;&#x308C;&#x3066;&#x3044;&#x305F;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p>Linux&#x306E;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x74B0;&#x5883;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x304B;&#x898B;&#x305F;&#x76EE;&#xFF0C;&#x306F;&#x661F;&#x306E;&#x6570;&#x307B;&#x3069;&#x3042;&#x308B;&#x304C;&#xFF0C;&#x306A;&#x304B;&#x3067;&#x3082;LXDE&#x306F;&#x5727;&#x5012;&#x7684;&#x306A;&#x8EFD;&#x3055;&#x3068;&#x6A5F;&#x80FD;&#x306E;&#x53CC;&#x65B9;&#x3092;&#x517C;&#x306D;&#x5099;&#x3048;&#x305F;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x74B0;&#x5883;&#x3068;&#x3057;&#x3066;&#x4EBA;&#x6C17;&#x3067;&#x3042;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x6614;&#x306A;&#x3089;&#x305D;&#x308C;&#x3067;&#x3088;&#x304B;&#x3063;&#x305F;&#x306E;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3051;&#x3069;&#xFF0C;&#x8A8D;&#x8A3C;&#x9375;&#x3067;&#x3061;&#x3087;&#x3063;&#x3068;&#x624B;&#x3053;&#x305A;&#x3063;&#x3061;&#x3083;&#x3063;&#x3066;&#x3002;&#x3042;&#x3068;&#x8D77;&#x52D5;&#x76F4;&#x5F8C;&#x306E;&#x30E1;&#x30E2;&#x30EA;&#x6D88;&#x8CBB;&#x91CF;&#x306F;&#x5C11;&#x306A;&#x3044;&#x3051;&#x3069;&#xFF0C;&#x79C1;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x306A;&#x3089;Xfce&#x3068;&#x3042;&#x307E;&#x308A;&#x5909;&#x308F;&#x3089;&#x306A;&#x3044;&#x306A;&#xFF0C;&#x3068;&#x601D;&#x3063;&#x3066;&#x300D;  </p>
<p>Xfce&#x3082;LXDE&#x3068;&#x4E26;&#x3076;&#x4EBA;&#x6C17;&#x306E;&#x8EFD;&#x91CF;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x74B0;&#x5883;&#x3067;&#x3042;&#x308B;&#x3002;LXDE&#x3088;&#x308A;&#x591A;&#x5C11;&#x30E1;&#x30E2;&#x30EA;&#x6D88;&#x8CBB;&#x91CF;&#x306F;&#x591A;&#x3044;&#x304C;&#xFF0C;&#x305D;&#x306E;&#x5206;&#x6A5F;&#x80FD;&#x3082;&#x8C4A;&#x5BCC;&#x3060;&#x3068;&#x3044;&#x308F;&#x308C;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x541B;&#x304C;&#x79C1;&#x3092;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x3057;&#x3066;&#x3057;&#x304B;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x306E;&#x306A;&#x3089;MATE&#x3084;cinnamon&#x3067;&#x3082;&#x4F55;&#x3067;&#x3082;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x3060;&#x3081;!&#x3060;&#x3063;&#x3066;&#x541B;&#x305A;&#x3063;&#x3068;&#x30B9;&#x30EF;&#x30C3;&#x30D7;&#x304C;&#x771F;&#x3063;&#x8D64;&#x3060;&#x3063;&#x305F;&#x3058;&#x3083;&#x3093;&#x3002;&#x899A;&#x3048;&#x3066;&#x306A;&#x3044;&#x306E;&#xFF1F;&#x300D;  </p>
<p>&#x661F;&#x306E;&#x6570;&#x307B;&#x3069;&#x3042;&#x308B;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x74B0;&#x5883;&#x306E;&#x306A;&#x304B;&#x3067;&#x3082;&#xFF0C;GNOME&#x3068;KDE&#x306F;&#x53CC;&#x74A7;&#x3092;&#x306A;&#x3059;&#x3068;&#x3044;&#x308F;&#x308C;&#x308B;&#x3002;&#x305D;&#x306E;&#x306A;&#x304B;&#x3067;MATE&#x3068;cinnamon&#x306F;GNOME 3&#x306B;&#x304A;&#x3051;&#x308B;&#x8B70;&#x8AD6;&#x304B;&#x3089;&#x5206;&#x88C2;&#x3057;&#x3066;&#x3067;&#x304D;&#x305F;&#x3082;&#x306E;&#x3067;&#x3042;&#x308A;&#xFF0C;&#x3069;&#x3061;&#x3089;&#x3082;&#x6D17;&#x7DF4;&#x3055;&#x308C;&#x305F;&#x898B;&#x305F;&#x76EE;&#x3068;&#x4F7F;&#x3044;&#x52DD;&#x624B;&#x3067;&#x4EBA;&#x6C17;&#x306E;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x74B0;&#x5883;&#x3067;&#x3042;&#x308B;&#x3002;&#x305F;&#x3060;&#x3057;LXDE&#x3084;Xfce&#x306B;&#x6BD4;&#x3079;&#x308B;&#x3068;&#x8CA0;&#x8377;&#x306F;&#x9AD8;&#x304F;&#xFF0C;&#x30E1;&#x30E2;&#x30EA;&#x6D88;&#x8CBB;&#x91CF;&#x3082;&#x591A;&#x3044;&#x3002;&#x8981;&#x3059;&#x308B;&#x306B;&#x91CD;&#x3044;&#x3002;  </p>
<p>MATE&#x3092;&#x63A1;&#x7528;&#x3057;&#x305F;Ubuntu MATE&#x3068;&#xFF0C;cinnamon&#x3092;&#x63A1;&#x7528;&#x3057;&#x305F;Linux Mint&#x3092;EeePC&#x3067;&#x8A66;&#x3057;&#x305F;&#x969B;&#xFF0C;&#x30B9;&#x30EF;&#x30C3;&#x30D7;&#x304C;&#x3069;&#x3093;&#x3069;&#x3093;&#x98DF;&#x308F;&#x308C;&#xFF0C;HDD&#x306E;&#x30B4;&#x30EA;&#x30B4;&#x30EA;&#x3068;&#x3044;&#x3046;&#x97F3;&#x304C;&#x6B62;&#x307E;&#x305A;&#x5FC3;&#x914D;&#x3067;&#x3042;&#x3063;&#x305F;&#x3002;&#x58CA;&#x308C;&#x308B;&#x307E;&#x3067;&#x4F7F;&#x3046;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x610F;&#x5473;&#x3067;&#x306F;&#x624B;&#x3063;&#x53D6;&#x308A;&#x65E9;&#x304F;&#x58CA;&#x305B;&#x3066;&#x3044;&#x3044;&#x306E;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x672C;&#x610F;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x540C;&#x3058;&#x7406;&#x7531;&#x3067;&#xFF0C;Xfce&#x3092;&#x63A1;&#x7528;&#x3059;&#x308B;Xubuntu&#x3082;&#x5019;&#x88DC;&#x304B;&#x3089;&#x5916;&#x308C;&#x305F;&#x3002;&#x304B;&#x306A;&#x308A;&#x6C17;&#x306B;&#x5165;&#x3063;&#x3066;&#x3044;&#x305F;&#x306E;&#x3060;&#x304C;&#x3002;  </p>
<p>&#x3053;&#x3046;&#x3057;&#x3066;&#x3042;&#x3042;&#x3067;&#x3082;&#x306A;&#x3044;&#xFF0C;&#x3053;&#x3046;&#x3067;&#x3082;&#x306A;&#x3044;&#x3068;EeePC&#x3068;&#x76F8;&#x8AC7;&#x3057;&#x306A;&#x304C;&#x3089;&#xFF0C;&#x79C1;&#x306F;&#x5019;&#x88DC;&#x3092;&#x7D5E;&#x3063;&#x3066;&#x3044;&#x3063;&#x305F;&#x3002;  </p>
<p><br><br>&#x5019;&#x88DC;&#x3082;&#x6B8B;&#x308A;&#x6570;&#x7A2E;&#x3068;&#x306A;&#x3063;&#x3066;&#xFF0C;&#x79C1;&#x304C;Linux Mint Debian Edition&#xFF0C;&#x901A;&#x79F0;LMDE&#x3092;&#x5019;&#x88DC;&#x304B;&#x3089;&#x5916;&#x3057;&#x305F;&#x3068;&#x304D;&#xFF0C;EeePC&#x304C;&#x98DF;&#x3044;&#x3055;&#x304C;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x306A;&#x305C;&#x3060;&#xFF1F;&#x541B;&#x306F;&#x304B;&#x306A;&#x308A;&#x6E80;&#x8DB3;&#x3057;&#x3066;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x305F;&#x3088;&#x3046;&#x3060;&#x3063;&#x305F;&#x304C;&#x300D;  </p>
<p>&#x305D;&#x306E;&#x901A;&#x308A;&#x3060;&#x3063;&#x305F;&#x3002;cinnamon&#x3092;&#x63A1;&#x7528;&#x3057;&#x306A;&#x304C;&#x3089;&#x30E1;&#x30E2;&#x30EA;&#x306E;&#x6D88;&#x8CBB;&#x91CF;&#x3082;&#x5C11;&#x306A;&#x304F;&#xFF0C;EeePC&#x3067;&#x3082;&#x3042;&#x307E;&#x308A;&#x4E0D;&#x6E80;&#x306A;&#x304F;&#x4F7F;&#x3048;&#x308B;LMDE&#x306F;&#x6C7A;&#x5B9A;&#x7248;&#x3068;&#x3044;&#x3063;&#x3066;&#x3088;&#x3044;&#x307B;&#x3069;&#x7D20;&#x6674;&#x3089;&#x3057;&#x304B;&#x3063;&#x305F;&#x3002;&#x3060;&#x304C;&#x79C1;&#x81EA;&#x8EAB;&#x306E;&#xFF0C;&#x7D76;&#x5BFE;&#x306B;&#x5916;&#x305B;&#x306A;&#x3044;&#x4E00;&#x70B9;&#x304C;&#x3053;&#x3053;&#x306B;&#x6765;&#x3066;&#x8DB3;&#x3092;&#x5F15;&#x3063;&#x5F35;&#x3063;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x3054;&#x3081;&#x3093;&#x3002;&#x3067;&#x3082;LMDE&#x306E;luatex&#x304C;&#x53E4;&#x304B;&#x3063;&#x305F;&#x3093;&#x3060;&#x300D;  </p>
<p>&#x306A;&#x3093;&#x3068;&#x3082;&#x7463;&#x672B;&#x306A;&#x3053;&#x3068;&#x306E;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x308B;&#x3002;&#x300C;&#x79C1;&#x306F;luatex&#x3067;TeX&#x306E;&#x6587;&#x66F8;&#x3092;&#x66F8;&#x304F;&#x304B;&#x3089;&#xFF0C;OTF&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x53E4;&#x3044;luatex&#x3058;&#x3083;&#x30C0;&#x30E1;&#x306A;&#x306E;&#x300D;&#x300C;TTF&#x306B;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;OTF&#x304C;&#x3044;&#x3044;&#x306E;!&#x300D;&#x300C;&#x3042;&#xFF0C;&#x2026;&#x305D;&#x3046;&#x300D;&#x300C;&#x305D;&#x308C;&#x306B;OTF&#x3092;.fonts&#x30C7;&#x30A3;&#x30EC;&#x30AF;&#x30C8;&#x30EA;&#x306B;&#x5165;&#x308C;&#x305F;&#x307E;&#x307E;&#x3060;&#x3068;luaotfload-tool&#x304C;&#x6B62;&#x307E;&#x3063;&#x3061;&#x3083;&#x3046;&#x3002;&#x30A4;&#x30F3;&#x30C7;&#x30C3;&#x30AF;&#x30B9;&#x304C;&#x4F5C;&#x308C;&#x306A;&#x3044;&#x304B;&#x3089;&#x300D;&#x300C;&#x3075;&#x3080;&#x3002;&#x305F;&#x3060;&#xFF0C;&#x305D;&#x308C;&#x306A;&#x3089;TeX&#x304C;&#x53E4;&#x3044;Ubuntu LTS&#x7CFB;&#x306F;&#x771F;&#x3063;&#x5148;&#x306B;&#x5019;&#x88DC;&#x304B;&#x3089;&#x5916;&#x308C;&#x305D;&#x3046;&#x306A;&#x3082;&#x306E;&#x3060;&#x304C;&#x300D;&#x300C;Ubuntu&#x306F;ppa&#x3067;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3092;&#x63D0;&#x4F9B;&#x3057;&#x3066;&#x304F;&#x308C;&#x305F;&#x4EBA;&#x304C;&#x3044;&#x305F;&#x304B;&#x3089;&#x5BFE;&#x5FDC;&#x3067;&#x304D;&#x305F;&#x300D;&#x300C;LMDE&#x306B;&#x306F;&#x305D;&#x308C;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x308F;&#x3051;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x300D;  </p>
<p>EeePC&#x306F;&#x3057;&#x3070;&#x3057;&#x6C88;&#x9ED9;&#x3057;&#x305F;&#x3002;&#x300C;&#x3067;&#x306F;&#x79C1;&#x306B;&#x5165;&#x308B;Linux&#x306F;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x3042;&#x308B;&#x3088;&#x300D;&#x300C;&#x4F55;&#x3060;&#xFF1F;&#x300D;  </p>
<p>&#x79C1;&#x306F;&#x305D;&#x306E;&#x554F;&#x3044;&#x306B;&#x7B54;&#x3048;&#x305A;&#x304A;&#x3082;&#x3080;&#x308D;&#x306B;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x3092;&#x59CB;&#x3081;&#x305F;&#x3002;  </p>
<p>&#x518D;&#x8D77;&#x52D5;&#x3057;&#xFF0C;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;  </p>
<p><br><br><img src="images/01.png" alt="debian-screen">  </p>
<p>&#x300C;&#x3058;&#x3083;&#x30FC;&#x3093;&#x300D;  </p>
<p>&#x300C;&#x306A;&#x308B;&#x307B;&#x3069;&#xFF0C;Debian&#x300E;&#x7CFB;&#x300F;&#x3067;&#x306F;&#x306A;&#x304F;&#xFF0C;&#x305D;&#x306E;&#x3082;&#x306E;&#x3092;&#x5165;&#x308C;&#x305F;&#x308F;&#x3051;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x3002;Debian&#x3060;&#x3068;&#x30B9;&#x30EF;&#x30C3;&#x30D7;&#x3092;8GB&#x78BA;&#x4FDD;&#x3059;&#x308C;&#x3070;&#xFF0C;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x30BF;&#x30D6;&#x3092;10&#x500B;&#x304F;&#x3089;&#x3044;&#x958B;&#x3044;&#x3066;&#x3082;&#x30E1;&#x30E2;&#x30EA;&#x306F;&#x4F7F;&#x3044;&#x304D;&#x3089;&#x306A;&#x3044;&#x300D;&#x300C;Xfce&#x3067;&#x3082;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3046;&#x3093;&#x300D;&#x300C;&#x305D;&#x3093;&#x306A;&#x306B;&#x30B9;&#x30EF;&#x30C3;&#x30D7;&#x8981;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x305F;&#x3076;&#x3093;&#x3044;&#x3089;&#x306A;&#x3044;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x3067;&#x3082;2GB&#x306F;&#x4F7F;&#x3046;&#x300D;  </p>
<p>&#x300C;&#x3060;&#x304C;luatex&#x306F;&#x3069;&#x3046;&#x3057;&#x305F;&#x3093;&#x3060;&#xFF1F;&#x7121;&#x7DDA;LAN&#x3082;&#x8A8D;&#x8B58;&#x3057;&#x306A;&#x3044;&#x306F;&#x305A;&#x3060;&#x304C;&#x300D;&#x300C;luatex&#x306F;&#x4E00;&#x6642;&#x7684;&#x306B;sid&#x3092;&#x6709;&#x52B9;&#x306B;&#x3057;&#x3066;&#x5165;&#x308C;&#x305F;&#x3057;&#xFF0C;&#x7121;&#x7DDA;&#x306F;firmware-linux-nonfree&#x3092;&#x5165;&#x308C;&#x305F;&#x3089;&#x8A8D;&#x8B58;&#x3057;&#x305F;&#x3088;&#x300D;&#x300C;&#x3080;&#xFF0C;/etc/apt/sources.list&#x306B;contrib&#x3068;non-free&#x304C;&#x52A0;&#x3048;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x306A;&#x3002;&#x3053;&#x308C;&#x306F;&#x30D5;&#x30EA;&#x30FC;&#x30A6;&#x30A7;&#x30A2;&#x306E;&#x7CBE;&#x795E;&#x306B;&#x53CD;&#x3059;&#x308B;&#x3051;&#x3057;&#x304B;&#x3089;&#x3093;&#x884C;&#x70BA;&#x3060;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x300D;  </p>
<p>&#x300C;&#x5197;&#x8AC7;&#x3060;&#x300D;&#x300C;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3082;&#x5197;&#x8AC7;&#x8A00;&#x3046;&#x3093;&#x3060;&#x300D;  </p>
<p>Debian GNU/Linux&#x306E;&#x30DA;&#x30FC;&#x30B8; (<a href="https://www.debian.org/index.ja.html" target="_blank">https://www.debian.org/index.ja.html</a>)  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01.html" class="navigation navigation-prev " aria-label="Previous page: 01 - EeePCとEmacsと私と">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="03.html" class="navigation navigation-next " aria-label="Next page: 03 - EeePCとEmacsとセットアップと">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"02 - EeePCとEmacsとLinuxと","level":"1.3","depth":1,"next":{"title":"03 - EeePCとEmacsとセットアップと","level":"1.4","depth":1,"path":"03.md","ref":"03.md","articles":[]},"previous":{"title":"01 - EeePCとEmacsと私と","level":"1.2","depth":1,"path":"01.md","ref":"01.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"02.md","mtime":"2018-08-05T05:10:57.160Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-24T20:58:16.317Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

