
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>03 - EeePCとEmacsとセットアップと · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="04.html" />
    
    
    <link rel="prev" href="02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >03 - EeePCとEmacsとセットアップと</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="03---eeepc&#x3068;emacs&#x3068;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x3068;">03 - EeePC&#x3068;Emacs&#x3068;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x3068;</h1>
<p>&#x305D;&#x308C;&#x304B;&#x3089;&#x79C1;&#x306F;EeePC&#x306B;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#xFF0C;&#x30DE;&#x30A6;&#x30B9;&#xFF0C;USB&#x30B9;&#x30D4;&#x30FC;&#x30AB;&#x30FC;&#x3092;&#x3064;&#x306A;&#x304E;&#xFF0C;PC&#x30E2;&#x30CB;&#x30BF;&#x306B;&#x5916;&#x90E8;&#x51FA;&#x529B;&#x3057;&#x305F;&#x3002;&#x5148;&#x306B;USB&#x7AEF;&#x5B50;&#x304C;&#x4E09;&#x3064;&#x3042;&#x308B;&#xFF0C;&#x3068;&#x8A00;&#x3063;&#x305F;&#x306E;&#x306F;&#x3053;&#x306E;&#x305F;&#x3081;&#x3067;&#x3042;&#x308B;&#x3002;  </p>
<p>&#x300C;&#x3084;&#x306F;&#x308A;&#x79C1;&#x306E;&#x753B;&#x9762;&#x3068;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3067;&#x306F;&#x3064;&#x3089;&#x3044;&#x304B;&#x300D;&#x300C;&#x3048;&#x3048;&#x3068;&#xFF0C;&#x305D;&#x308C;&#x3082;&#x3042;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x79C1;&#x3059;&#x3050;&#x306B;&#x8171;&#x9798;&#x708E;&#x306B;&#x306A;&#x3063;&#x3061;&#x3083;&#x3046;&#x304B;&#x3089;&#xFF0C;&#x666E;&#x901A;&#x306E;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3058;&#x3083;&#x30C0;&#x30E1;&#x306A;&#x3093;&#x3060;&#x300D;&#x300C;Kinesis&#x306E;&#x4F55;&#x4E07;&#x3082;&#x3059;&#x308B;&#x3084;&#x3064;&#x304B;&#x300D;&#x300C;&#x3046;&#x3046;&#x3093;&#xFF0C;&#x4ECA;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x306E;&#x306F;&#x30DE;&#x30A4;&#x30AF;&#x30ED;&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x5B89;&#x3044;&#x3084;&#x3064;&#x3002;&#x624B;&#x5143;&#x304C;&#x30CF;&#x306E;&#x5B57;&#x306B;&#x958B;&#x3044;&#x3066;&#x308B;&#x304B;&#x3089;&#x75DB;&#x304F;&#x306A;&#x3089;&#x306A;&#x3044;&#x300D;&#x300C;&#x3067;&#x3082;&#x541B;&#x306F;&#x624B;&#x304C;&#x5C0F;&#x3055;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;&#x5C4A;&#x304B;&#x306A;&#x3044;&#x30AD;&#x30FC;&#x3082;&#x3042;&#x308B;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x6570;&#x5B57;&#x3068;&#x304B;&#x7AEF;&#x306E;&#x30AD;&#x30FC;&#x3068;&#x304B;&#x306F;&#x9060;&#x3044;&#x306A;&#x3042;&#x3068;&#x601D;&#x3046;&#x3053;&#x3068;&#x306F;&#x3042;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x306E;&#x3068;&#x304D;&#x306F;&#x307B;&#x3068;&#x3093;&#x3069;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x3057;&#x3002;&#x305D;&#x3046;&#x305D;&#x3046;&#xFF0C;&#x3053;&#x3046;&#x3044;&#x3046;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x4F7F;&#x3063;&#x3066;&#x308B;&#x3068;&#x5909;&#x306A;&#x30AF;&#x30BB;&#x304C;&#x3064;&#x304F;&#xFF0C;&#x3063;&#x3066;&#x3044;&#x3046;&#x3051;&#x3069;&#x4ECA;&#x306E;&#x3068;&#x3053;&#x308D;&#x306F;&#x306A;&#x3044;&#x304B;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x753B;&#x9762;&#x306E;&#x5C0F;&#x3055;&#x3055;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x7B54;&#x3048;&#x3092;&#x805E;&#x3044;&#x3066;&#x3044;&#x306A;&#x3044;&#x304C;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x3084;&#x3063;&#x3071;&#x5C0F;&#x3055;&#x3044;&#xFF0C;&#x304B;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x308D;&#x3046;&#x306A;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x3067;&#x3082;&#x30D5;&#x30EB;HD&#x307E;&#x3067;&#x51FA;&#x529B;&#x3067;&#x304D;&#x308B;&#x3093;&#x3060;&#x3088;&#x3002;&#x52D5;&#x753B;&#x3060;&#x3063;&#x3066;720p&#x307E;&#x3067;&#x306A;&#x3089;&#x306A;&#x3093;&#x3068;&#x304B;&#x898B;&#x308C;&#x308B;&#x3093;&#x3060;&#x3002;&#x3059;&#x3054;&#x304F;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x3092;&#x30B9;&#x30C6;&#x30A3;&#x30C3;&#x30AF;PC&#x3084;NUC&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3046;&#x3064;&#x3082;&#x308A;&#x306A;&#x306E;&#x3060;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x305D;&#x3046;&#x300D;&#x300C;&#x30CE;&#x30FC;&#x30C8;PC&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3046;&#x3064;&#x3082;&#x308A;&#x306F;&#x3082;&#x3046;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x3044;&#x3084;&#x3042;&#xFF0C;&#x30E2;&#x30CB;&#x30BF;&#x306B;&#x51FA;&#x305B;&#x308B;&#x306E;&#x77E5;&#x3063;&#x3061;&#x3083;&#x3063;&#x305F;&#x3089;&#x76EE;&#x304C;&#x30E9;&#x30AF;&#x3067;&#x3055;&#x3042;&#x300D;&#x300C;&#x2026;&#x307E;&#x3042;&#xFF0C;&#x73FE;&#x5F79;&#x3067;&#x4F7F;&#x3046;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x541B;&#x306E;&#x8A00;&#x8449;&#x306B;&#x507D;&#x308A;&#x304C;&#x306A;&#x3044;&#x306A;&#x3089;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x3082;&#x3044;&#x3044;&#x3060;&#x308D;&#x3046;&#x300D;  </p>
<p>&#x79C1;&#x3068;EeePC&#x306F;&#x5FC5;&#x8981;&#x306A;&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3092;&#x59CB;&#x3081;&#x305F;&#x3002;&#x5148;&#x306E;&#x753B;&#x50CF;&#x306F;&#x305D;&#x308C;&#x3092;&#x6E08;&#x307E;&#x305B;&#x305F;&#x5F8C;&#x306E;&#x3082;&#x306E;&#x3060;&#x304C;&#xFF0C;&#x307E;&#x3042;&#xFF0C;&#x305D;&#x306E;&#x3078;&#x3093;&#x306E;&#x624B;&#x629C;&#x304D;&#x306F;&#x5927;&#x76EE;&#x306B;&#x898B;&#x3066;&#x3082;&#x3089;&#x3044;&#x305F;&#x3044;&#x3002;  </p>
<p>&#x30BF;&#x30FC;&#x30DF;&#x30CA;&#x30EB;&#x3092;&#x5206;&#x5272;&#x3055;&#x305B;&#x308B;&#x305F;&#x3081;&#x306E;tmux&#x3002;&#x4F55;&#x306F;&#x306A;&#x304F;&#x3068;&#x3082;git&#x3002;texlive&#x3002;onedrive&#x3002;&#x5F8C;&#x3067;&#x4F7F;&#x3046;&#x305F;&#x3081;&#x306B;gnutls&#x3068;curl&#x3082;&#x5165;&#x308C;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x3060;&#xFF0C;&#x30CE;&#x30FC;&#x30C8;PC&#x3067;&#x601D;&#x3044;&#x51FA;&#x3057;&#x305F;&#x3002;&#x805E;&#x3044;&#x3066;&#x304F;&#x308C;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;&#x505C;&#x96FB;&#x306E;&#x3068;&#x304D;&#xFF0C;&#x541B;&#x306E;&#x753B;&#x9762;&#x3092;&#x767D;&#x80CC;&#x666F;&#x306B;&#x3057;&#x3066;&#x672C;&#x8AAD;&#x3093;&#x3060;&#x3053;&#x3068;&#x300D;&#x300C;&#x2026;&#x3042;&#x3042;&#x3002;&#x899A;&#x3048;&#x3066;&#x3044;&#x308B;&#x300D;&#x300C;&#x96FB;&#x7403;&#x306F;60&#x30EF;&#x30C3;&#x30C8;&#x3002;&#x541B;&#x306F;2.5&#x30EF;&#x30C3;&#x30C8;&#x304F;&#x3089;&#x3044;&#x3060;&#x3063;&#x305F;&#x304B;&#x306A;&#xFF1F;&#x3067;&#x3082;&#x660E;&#x308B;&#x304F;&#x3066;&#x3055;&#x3002;&#x6696;&#x623F;&#x3064;&#x3051;&#x3089;&#x308C;&#x306A;&#x3044;&#x304B;&#x3089;&#x5E03;&#x56E3;&#x5DFB;&#x3044;&#x3066;&#xFF0C;&#x982D;&#x306E;&#x4E2D;&#x3067;&#x307B;&#x305F;&#x308B;&#x306E;&#x5149;&#x304C;&#x9CF4;&#x3063;&#x3066;&#x305F;&#x3088;&#x3002;&#x306A;&#x3093;&#x304B;&#x9006;&#x5883;&#x306E;&#x306A;&#x304B;&#x306B;&#x3044;&#x308B;&#x304B;&#x3089;&#x304B;&#xFF0C;&#x3044;&#x3064;&#x3082;&#x3088;&#x308A;&#x52C9;&#x5F37;&#x306B;&#x8EAB;&#x304C;&#x5165;&#x3063;&#x305F;&#x3068;&#x3044;&#x3046;&#x304B;&#x300D;&#x300C;&#x3058;&#x3083;&#x3042;&#x305A;&#x3063;&#x3068;&#x505C;&#x96FB;&#x3057;&#x3066;&#x3044;&#x308C;&#x3070;&#x3044;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x305D;&#x308C;&#x306F;&#x3084;&#x3060;&#x306A;&#x30FC;&#x300D;  </p>
<p>&#x305D;&#x3093;&#x306A;&#x7121;&#x99C4;&#x8A71;&#x3092;&#x3057;&#x306A;&#x304C;&#x3089;EeePC&#x306E;&#x809D;&#x3068;&#x306A;&#x308B;&#x30BD;&#x30D5;&#x30C8;&#x306E;&#x5C0E;&#x5165;&#x3092;&#x59CB;&#x3081;&#x305F;&#x3002;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3092;&#x517C;&#x306D;&#x308B;emacs&#x3067;&#x3042;&#x308B;&#x3002;&#x3053;&#x308C;&#x3092;&#x66F8;&#x3044;&#x3066;&#x3044;&#x308B;&#x6642;&#x70B9;&#x306E;&#x6700;&#x65B0;&#x7248;&#x306F;25.3&#xFF0C;sid&#x3067;&#x306F;25.2&#x3067;&#x6B62;&#x307E;&#x3063;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#xFF0C;&#x30BD;&#x30FC;&#x30B9;&#x304B;&#x3089;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#xFF0C;&#x79C1;&#x3067;&#x306F;&#x60F3;&#x50CF;&#x3067;&#x304D;&#x306A;&#x3044;&#x307B;&#x3069;&#x9AD8;&#x5EA6;&#x306A;&#x4F5C;&#x696D;&#x304C;&#x6C42;&#x3081;&#x3089;&#x308C;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x3068;&#x306F;&#x3044;&#x3048;&#x904E;&#x53BB;&#x306B;&#x7D4C;&#x9A13;&#x304C;&#x3042;&#x308B;&#x3002;build-dep&#x3067;&#x5FC5;&#x8981;&#x306A;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3092;&#x5C0E;&#x5165;&#x3057;&#x3066;configure&#x3068;make&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x3042;&#x308B;&#x3002;&#x3059;&#x308B;&#x3060;&#x3051;&#xFF0C;&#x3068;&#x3044;&#x3063;&#x3066;&#x3082;configure&#x306E;&#x6700;&#x4E2D;&#x306F;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x51FA;&#x306A;&#x3044;&#x304B;&#x304A;&#x308D;&#x304A;&#x308D;&#x3059;&#x308B;&#x306E;&#x3060;&#x304C;&#x3002;  </p>
<p>&#x79C1;&#x306F;&#x3046;&#x306A;&#x308A;&#x3092;&#x4E0A;&#x3052;&#x3066;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x3092;&#x7D9A;&#x3051;&#x308B;EeePC&#x306B;&#x610F;&#x5730;&#x60AA;&#x306B;&#x3082;&#x8A71;&#x3057;&#x304B;&#x3051;&#x305F;&#x3002;&#x300C;Meltdown&#x3068;Spectre&#x3063;&#x3066;&#x77E5;&#x3063;&#x3066;&#x308B;&#xFF1F;&#x300D;&#x300C;&#x3042;&#x3042;&#x3082;&#x3046;&#x3002;&#x4F55;&#x5EA6;&#x3082;&#x805E;&#x3044;&#x305F;&#x3002;&#x805E;&#x304D;&#x98FD;&#x304D;&#x305F;&#x3002;CPU&#x306E;&#x8106;&#x5F31;&#x6027;&#x3060;&#x300D;&#x300C;&#x305D;&#x3046;&#x3002;&#x541B;&#x306F;&#x305D;&#x306E;&#x5F71;&#x97FF;&#x53D7;&#x3051;&#x306A;&#x3044;&#x3063;&#x3066;&#x77E5;&#x3063;&#x3066;&#x305F;&#xFF1F;&#x300D;&#x300C;&#x77E5;&#x3089;&#x306A;&#x3044;&#x3057;&#x8208;&#x5473;&#x3082;&#x306A;&#x3044;&#x3057;&#x805E;&#x304D;&#x305F;&#x304F;&#x3082;&#x306A;&#x3044;&#x300D;&#x300C;&#x5C11;&#x3057;&#x306F;&#x805E;&#x3044;&#x3066;&#x304F;&#x308C;&#x3066;&#x3082;&#x3044;&#x3044;&#x3058;&#x3083;&#x3093;&#x300D;  </p>
<p>&#x79C1;&#x306E;&#x62D9;&#x3044;&#x77E5;&#x8B58;&#x3067;&#x306F;&#xFF0C;&#x4ECA;&#x5E74;&#x306E;&#x521D;&#x982D;&#x306B;&#x4E16;&#x754C;&#x3092;&#x6DF7;&#x4E71;&#x306E;&#x6E26;&#x306B;&#x9665;&#x308C;&#x305F;&#x3053;&#x306E;&#x4E8C;&#x3064;&#x306E;&#x8106;&#x5F31;&#x6027;&#x306F;&#xFF0C;CPU&#x306E;Out of order&#x6A5F;&#x69CB;&#xFF0C;&#x304A;&#x3088;&#x3073;Speculative execution&#x306B;&#x8D77;&#x56E0;&#x3059;&#x308B;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;&#x3057;&#x304B;&#x3057;EeePC&#x306B;&#x642D;&#x8F09;&#x3055;&#x308C;&#x305F;CPU&#x3067;&#x3042;&#x308B;&#x3068;&#x3053;&#x308D;&#x306E;Atom N270&#x306F;In-order&#x6A5F;&#x69CB;&#x3092;&#x63A1;&#x7528;&#x3057;&#xFF0C;&#x3057;&#x304B;&#x3082;&#x82F1;&#x8A9E;&#x7248;wikipedia&#x306B;&#x3088;&#x308B;&#x3068;Speculative execution&#x3082;&#x6301;&#x305F;&#x306A;&#x3044;&#x3088;&#x3046;&#x3060;&#x3002;&#x305D;&#x3093;&#x306A;&#x308F;&#x3051;&#x3067;&#xFF0C;PC&#x306E;&#x307F;&#x306A;&#x3089;&#x305A;&#xFF0C;&#x30B9;&#x30DE;&#x30DB;&#xFF0C;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x7AEF;&#x672B;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;&#x307B;&#x307C;&#x5168;&#x3066;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306B;&#x5F71;&#x97FF;&#x3092;&#x53CA;&#x307C;&#x3059;&#xFF0C;&#x3068;&#x307E;&#x3067;&#x8A00;&#x308F;&#x308C;&#x305F;&#x3053;&#x306E;&#x6050;&#x308D;&#x3057;&#x3044;&#x8106;&#x5F31;&#x6027;&#x306B;&#x5BFE;&#x3057;&#xFF0C;EeePC&#x306F;&#x8010;&#x6027;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x305F;&#x6570;&#x5C11;&#x306A;&#x3044;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3060;&#x3063;&#x305F;&#x3068;&#x3044;&#x3048;&#x308B;&#x3002;&#x9055;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3051;&#x3069;&#x3002;  </p>
<p>&#x305D;&#x3046;&#x3053;&#x3046;&#x3057;&#x3066;&#x3044;&#x308B;&#x9593;&#x306B;emacs&#x306E;&#x30D3;&#x30EB;&#x30C9;&#x3068;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x304C;&#x7D42;&#x308F;&#x3063;&#x305F;&#x306E;&#x3067;&#xFF0C;emacs&#x306B;&#x3082;&#x308A;&#x3082;&#x308A;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x3092;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3057;&#x3066;&#x3044;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x79C1;&#x3092;&#x73FE;&#x5F79;&#x306B;&#x5FA9;&#x5E30;&#x3055;&#x305B;&#x308B;&#x3064;&#x3082;&#x308A;&#x306A;&#x3089;&#x4ECA;&#x306E;&#x3046;&#x3061;&#x306B;&#x8A00;&#x3063;&#x3066;&#x304A;&#x304F;&#x304C;&#xFF0C;&#x79C1;&#x3067;&#x9023;&#x6587;&#x7BC0;&#x5909;&#x63DB;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3068;&#x601D;&#x3063;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x77E5;&#x3063;&#x3066;&#x308B;&#x3088;&#x305D;&#x3093;&#x306A;&#x3053;&#x3068;&#x300D;  </p>
<p>&#x3055;&#x3089;&#x3063;&#x3068;&#x6D41;&#x3057;&#x305F;&#x304C;&#xFF0C;&#x3053;&#x3053;&#x306B;&#x306F;&#x5927;&#x304D;&#x306A;&#x554F;&#x984C;&#x304C;&#x3042;&#x308B;&#x3002;&#x9023;&#x6587;&#x7BC0;&#x5909;&#x63DB;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x4E00;&#x822C;&#x3067;&#x3044;&#x3046;&#x65E5;&#x672C;&#x8A9E;&#x5909;&#x63DB;&#x306E;&#x3053;&#x3068;&#x3067;&#x3042;&#x308B;&#x3002;Linux&#x3067;&#x306F;&#x3053;&#x308C;&#x3089;&#x3092;&#x884C;&#x3046;&#x969B;&#xFF0C;mozc&#x3084;anthy&#x3068;&#x3044;&#x3063;&#x305F;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x3092;ibus&#x306A;&#x3069;&#x306E;&#x30A4;&#x30F3;&#x30D7;&#x30C3;&#x30C8;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x3092;&#x4ECB;&#x3057;&#x3066;&#x4F7F;&#x3046;&#x306E;&#x3060;&#x304C;&#xFF0C;&#x3053;&#x308C;&#x304C;&#x610F;&#x5916;&#x306B;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x304B;&#x304B;&#x306A;&#x308A;&#x91CD;&#x304F;&#xFF0C;EeePC&#x3067;&#x306F;&#x901A;&#x5E38;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x3059;&#x308B;&#x306E;&#x304C;&#x305F;&#x3081;&#x3089;&#x308F;&#x308C;&#x308B;&#x307B;&#x3069;&#x3060;&#x3002;&#x591A;&#x304F;&#x306E;&#x4EBA;&#x306F;&#x30D6;&#x30ED;&#x30B0;&#x6295;&#x7A3F;&#x3084;&#x30CD;&#x30C3;&#x30C8;&#x5C0F;&#x8AAC;&#x306A;&#x3069;&#x3092;&#x66F8;&#x304F;&#x3068;&#x304D;&#x306B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x4E0A;&#x3067;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x3044;&#x3066;&#x3044;&#x308B;&#x3068;&#x601D;&#x3046;&#x304C;&#xFF0C;&#x305D;&#x308C;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3068;&#x8003;&#x3048;&#x305F;&#x307B;&#x3046;&#x304C;&#x3088;&#x3044;&#x3002;  </p>
<p>&#x79C1;&#x306F;&#x8A2D;&#x5B9A;&#x3092;&#x7D42;&#x3048;&#x305F;emacs&#x3092;&#x8D77;&#x52D5;&#x3057;&#x306A;&#x304A;&#x3057;&#xFF0C;F11&#x30AD;&#x30FC;&#x3067;&#x5168;&#x753B;&#x9762;&#x306B;&#x3059;&#x308B;&#x3068;&#xFF0C;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x3092;&#x5206;&#x5272;&#x3057;&#x3066;EeePC&#x306B;&#x898B;&#x305B;&#x305F;&#x3002;  </p>
<p><img src="images/02.png" alt="emacs-screen">  </p>
<p>&#x300C;&#x3069;&#x3046;&#xFF1F;&#x7D50;&#x69CB;&#x3044;&#x3044;&#x3067;&#x3057;&#x3087;&#x300D;&#x300C;&#x898B;&#x305F;&#x76EE;&#x3060;&#x3051;&#x306A;&#x3089;&#x306A;&#x3002;&#x3084;&#x3051;&#x306B;&#x9ED2;&#x3044;&#x304C;&#x300D;&#x300C;&#x767D;&#x3044;&#x3068;&#x76EE;&#x304C;&#x30C1;&#x30AB;&#x30C1;&#x30AB;&#x3059;&#x308B;&#x3093;&#x3060;&#x3088;&#x3002;&#x3060;&#x304B;&#x3089;&#x6696;&#x8272;&#x7CFB;&#x306B;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#x3002;warm-night-mode&#x3063;&#x3066;&#x3044;&#x3046;&#x30C6;&#x30FC;&#x30DE;&#x300D;  </p>
<p>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x672C;&#x6587;&#x306E;&#x4E0A;&#x3068;&#x53F3;&#x306B;&#x4F59;&#x767D;&#x304C;&#x3042;&#x308B;&#x306E;&#x306F;&#x4F55;&#x304B;&#x306B;&#x4F7F;&#x3046;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x79C1;&#x306E;&#x8996;&#x754C;&#x306B;&#x5165;&#x3089;&#x306A;&#x3044;&#x304B;&#x3089;&#x5207;&#x3063;&#x3066;&#x308B;&#x3060;&#x3051;&#x300D;  </p>
<p>&#x300C;&#x3075;&#x3080;&#x3002;&#x3042;&#x3068;&#x672C;&#x6587;&#x306E;&#x9818;&#x57DF;&#x304C;&#x4E2D;&#x592E;&#x3088;&#x308A;&#x53F3;&#x306B;&#x5BC4;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x304C;&#x6C17;&#x306B;&#x306A;&#x308B;&#x306A;&#x300D;&#x300C;&#x305D;&#x3053;&#x6CE8;&#x76EE;&#x3059;&#x308B;&#x3068;&#x3053;&#xFF1F;&#x300D;&#x300C;GitHub&#x306E;Zen Writing Mode&#x3068;&#x304B;&#xFF0C;Ommwriter&#x3068;&#x304B;&#xFF0C;&#x666E;&#x901A;&#x306F;&#x771F;&#x3093;&#x4E2D;&#x306B;&#x7F6E;&#x304F;&#x3082;&#x306E;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3093;&#xFF0C;&#x8AAC;&#x660E;&#x3057;&#x3066;&#x9762;&#x5012;&#x306A;&#x3084;&#x3064;&#x3060;&#x3068;&#x601D;&#x308F;&#x308C;&#x308B;&#x306E;&#x3084;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x597D;&#x307F;&#x3063;&#x3066;&#x3053;&#x3068;&#x306B;&#x3057;&#x3066;&#x304A;&#x3044;&#x3066;&#x300D;  </p>
<p>&#x300C;&#x96A0;&#x3057;&#x3054;&#x3068;&#x306F;&#x7121;&#x3057;&#x306B;&#x3057;&#x3088;&#x3046;&#x300D;&#x300C;&#x3048;&#x30FC;&#x2026;&#x3002;&#x306F;&#x3041;&#x3002;&#x3048;&#x3063;&#x3068;&#xFF0C;&#x4EBA;&#x9593;&#x306E;&#x8996;&#x91CE;&#x306E;&#x4E2D;&#x5FC3;&#x306F;&#x5B9F;&#x306F;&#x771F;&#x3093;&#x4E2D;&#x3088;&#x308A;&#x3082;&#x5DE6;&#x5074;&#x306B;&#x3042;&#x3063;&#x3066;&#x2026;&#x300D;&#x300C;&#x9762;&#x5012;&#x304F;&#x3055;&#x305D;&#x3046;&#x3060;&#x306A;&#x300D;&#x300C;&#x2026;&#x300D;&#x300C;&#x3059;&#x307E;&#x3093;&#x3002;&#x7D9A;&#x3051;&#x3066;&#x304F;&#x308C;&#x300D;&#x300C;&#x2026;&#x3067;&#x3082;&#x79C1;&#x306E;&#x5834;&#x5408;&#x306F;&#xFF0C;&#x771F;&#x3093;&#x4E2D;&#x3088;&#x308A;&#x53F3;&#x306B;&#x3042;&#x308B;&#x304B;&#x3089;&#x3053;&#x3046;&#x3057;&#x305F;&#x307B;&#x3046;&#x304C;&#x898B;&#x3084;&#x3059;&#x3044;&#x306E;&#x3002;&#x3060;&#x3044;&#x305F;&#x3044;&#x306E;&#x4EBA;&#x306F;&#x771F;&#x3093;&#x4E2D;&#x3088;&#x308A;&#x5DE6;&#x306B;&#x3042;&#x308B;&#x306F;&#x305A;&#x3060;&#x304B;&#x3089;&#xFF0C;&#x5DE6;&#x53F3;&#x306E;&#x914D;&#x7F6E;&#x3092;&#x5168;&#x90E8;&#x771F;&#x9006;&#x306B;&#x3057;&#x305F;&#x307B;&#x3046;&#x304C;&#x898B;&#x3084;&#x3059;&#x3044;&#x3068;&#x601D;&#x3046;&#x3002;&#x541B;&#x306F;&#x753B;&#x9762;&#x306E;&#x5DE6;&#x304C;&#x3054;&#x3061;&#x3083;&#x3054;&#x3061;&#x3083;&#x3057;&#x3066;&#x898B;&#x3048;&#x308B;&#x3067;&#x3057;&#x3087;&#x300D;  </p>
<p>&#x300C;&#x79C1;&#x306F;&#x4EBA;&#x9593;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3089;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x306A;&#x300D;&#x300C;&#x305D;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;&#x307E;&#x3042;&#x79C1;&#x306F;&#x6C17;&#x306B;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;&#x771F;&#x4F3C;&#x3059;&#x308B;&#x4EBA;&#x306A;&#x3093;&#x3066;&#x8AB0;&#x3082;&#x3044;&#x306A;&#x3044;&#x3051;&#x3069;&#x300D;&#x300C;&#x307E;&#x3063;&#x305F;&#x304F;&#x3060;&#x3002;&#x541B;&#x306F;&#x672C;&#x5F53;&#x306B;&#x5909;&#x308F;&#x3063;&#x305F;&#x3084;&#x3064;&#x3060;&#x306A;&#x3002;&#x79C1;&#x306E;&#x3088;&#x3046;&#x306A;&#x53E4;&#x3044;&#x6A5F;&#x68B0;&#x3092;&#x73FE;&#x5F79;&#x3067;&#x4F7F;&#x304A;&#x3046;&#x306A;&#x3093;&#x3066;&#x9154;&#x72C2;&#x306A;&#x3053;&#x3068;&#x3092;&#x3059;&#x308B;&#x306E;&#x3082;&#x7D0D;&#x5F97;&#x3057;&#x305F;&#x3088;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x305B;&#x3063;&#x304B;&#x304F;&#x4F7F;&#x3063;&#x3066;&#x3042;&#x3052;&#x308B;&#x3093;&#x3060;&#x304B;&#x3089;&#x5C11;&#x3057;&#x306F;&#x307B;&#x3081;&#x3066;&#x3088;&#x300D;  </p>
<p>GNU Emacs&#x306E;&#x30DA;&#x30FC;&#x30B8; (<a href="https://www.gnu.org/s/emacs/" target="_blank">https://www.gnu.org/s/emacs/</a>)  </p>
<p><br><br><br><br>&#x53C2;&#x8003;: &#x30EC;&#x30A4;&#x30A2;&#x30A6;&#x30C8;&#x306E;&#x5DE6;&#x53F3;&#x3092;&#x5165;&#x308C;&#x66FF;&#x3048;&#x305F;&#x3082;&#x306E;&#x3002;&#x71B1;&#x5F01;&#x3059;&#x308B;&#x307B;&#x3069;&#x306E;&#x9055;&#x3044;&#x306F;&#x306A;&#x3044;&#x3002;  </p>
<p><img src="images/02b.png" alt="screen-inverted">  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="02.html" class="navigation navigation-prev " aria-label="Previous page: 02 - EeePCとEmacsとLinuxと">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="04.html" class="navigation navigation-next " aria-label="Next page: 04 - EeePCとEmacsとSSDと日本語と">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"03 - EeePCとEmacsとセットアップと","level":"1.4","depth":1,"next":{"title":"04 - EeePCとEmacsとSSDと日本語と","level":"1.5","depth":1,"path":"04.md","ref":"04.md","articles":[]},"previous":{"title":"02 - EeePCとEmacsとLinuxと","level":"1.3","depth":1,"path":"02.md","ref":"02.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"03.md","mtime":"2018-08-05T05:10:57.163Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-05T11:39:57.797Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

