
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>04 - EeePCとEmacsとSSDと日本語と · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="05.html" />
    
    
    <link rel="prev" href="03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >04 - EeePCとEmacsとSSDと日本語と</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="04---eeepc&#x3068;emacs&#x3068;ssd&#x3068;&#x65E5;&#x672C;&#x8A9E;&#x3068;">04 - EeePC&#x3068;Emacs&#x3068;SSD&#x3068;&#x65E5;&#x672C;&#x8A9E;&#x3068;</h1>
<p>&#x4F55;&#x5EA6;&#x76EE;&#x304B;&#x306E;&#x518D;&#x8D77;&#x52D5;&#x3067;&#xFF0C;EeePC&#x304C;&#x6025;&#x306B;&#x9759;&#x304B;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x3059;&#x307E;&#x3093;&#x3002;&#x79C1;&#x306E;&#x7A7A;&#x51B7;&#x30D5;&#x30A1;&#x30F3;&#x304C;&#x58CA;&#x308C;&#x305F;&#x3088;&#x3046;&#x3060;&#x300D;&#x300C;&#x3044;&#x3044;&#x3088;&#x3002;&#x305D;&#x308C;&#x3088;&#x308A;&#x30B7;&#x30E3;&#x30FC;&#x3063;&#x3066;&#x97F3;&#x304C;&#x3059;&#x308B;&#x3051;&#x3069;&#x4F55;&#xFF1F;&#x300D;  </p>
<p>&#x300C;HDD&#x306E;&#x97F3;&#x3060;&#x3002;&#x3042;&#x3068;&#xFF0C;&#x3044;&#x3044;&#x3088;&#x3063;&#x3066;&#x3069;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;&#x30D5;&#x30A1;&#x30F3;&#x304C;&#x58CA;&#x308C;&#x305F;&#x3093;&#x3060;&#x305E;&#x300D;&#x300C;&#x305D;&#x3093;&#x306A;&#x306E;&#x3067;&#x71B1;&#x66B4;&#x8D70;&#x3059;&#x308B;&#x307B;&#x3069;&#x541B;&#x306F;&#x71B1;&#x3044;&#x30AD;&#x30E3;&#x30E9;&#x3058;&#x3083;&#x306A;&#x3044;&#x3067;&#x3057;&#x3087;&#x3002;&#x541B;&#x306E;CPU&#x304C;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x308B;&#x304B;&#x898B;&#x305F;&#x3053;&#x3068;&#x306A;&#x3044;&#x306E;&#xFF1F;&#x300D;&#x300C;&#x306A;&#x3044;&#x300D;&#x300C;&#x79C1;&#x306F;&#x3042;&#x308B;&#x300D;&#x300C;&#x3069;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;&#x30AC;&#x30E0;&#x307F;&#x305F;&#x3044;&#x306A;&#x30B7;&#x30FC;&#x30C8;&#x3067;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x88CF;&#x306B;&#x306F;&#x308A;&#x3064;&#x3051;&#x3066;&#x3042;&#x308B;&#x3060;&#x3051;&#x3060;&#x3088;&#x300D;&#x300C;&#x2026;&#x300D;  </p>
<p>&#x305D;&#x3046;&#x3002;EeePC&#x306E;CPU&#x306B;&#x30D2;&#x30FC;&#x30C8;&#x30B7;&#x30F3;&#x30AF;&#x306F;&#x3064;&#x3044;&#x3066;&#x304A;&#x3089;&#x305A;&#xFF0C;&#x30AD;&#x30FC;&#x30DC;&#x30FC;&#x30C9;&#x3092;&#x4ECB;&#x3057;&#x3066;&#x653E;&#x71B1;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x91CD;&#x3044;&#x51E6;&#x7406;&#x3092;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x306A;&#x3044;&#x304B;&#x3089;&#x304B;&#xFF0C;&#x3053;&#x306E;&#x5F8C;&#x30D5;&#x30A1;&#x30F3;&#x3092;&#x4EA4;&#x63DB;&#x305B;&#x305A;&#x3068;&#x3082;CPU&#x6E29;&#x5EA6;&#x304C;40&#x2103;&#x3092;&#x8D85;&#x3048;&#x308B;&#x3053;&#x3068;&#x3055;&#x3048;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;&#x3044;&#x3084;&#xFF0C;&#x305F;&#x307E;&#x306B;40&#x2103;&#x3092;&#x8D85;&#x3048;&#x305F;&#x3002;&#x3054;&#x304F;&#x305F;&#x307E;&#x306B;&#x3002;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;Web&#x30DA;&#x30FC;&#x30B8;&#x3092;&#x898B;&#x305F;&#x3068;&#x304D;&#x306B;&#x3002;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x3088;&#x308A;&#x3055;&#xFF0C;&#x30D5;&#x30A1;&#x30F3;&#x304C;&#x58CA;&#x308C;&#x305F;&#x3093;&#x306A;&#x3089;&#xFF0C;HDD&#x4EA4;&#x63DB;&#x3057;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;SSD&#x306B;&#x304B;&#x300D;&#x300C;&#x305D;&#x3046;&#x3002;&#x305D;&#x3046;&#x3059;&#x308C;&#x3070;&#x7121;&#x97F3;&#x306E;PC&#x306B;&#x306A;&#x308B;&#x3088;&#x3002;&#x30B7;&#x30E3;&#x30FC;&#xFF0C;&#x30AB;&#x30EA;&#x30AB;&#x30EA;&#xFF0C;&#x3063;&#x3066;&#x97F3;&#x3082;&#x306A;&#x304F;&#x306A;&#x308B;&#x300D;&#x300C;&#x305D;&#x306E;&#x91D1;&#x3067;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x8CB7;&#x3063;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x3068;&#x601D;&#x3046;&#x304C;&#x300D;  </p>
<p>Android&#x7AEF;&#x672B;&#x306B;termux&#x3092;&#x5165;&#x308C;&#x308C;&#x3070;Linux&#x74B0;&#x5883;&#x304C;&#x69CB;&#x7BC9;&#x3067;&#x304D;&#x308B;&#x3002;emacs&#x3082;&#x52D5;&#x304F;&#x3002;  </p>
<p>&#x300C;&#x79C1;&#x306F;&#x541B;&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x3093;&#x3060;&#x3051;&#x3069;&#x300D;&#x300C;&#x8FFD;&#x52A0;&#x51FA;&#x8CBB;&#x306F;&#x53CD;&#x5247;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;&#x300C;&#x3046;&#x308B;&#x3055;&#x3044;&#x306E;&#x306F;&#x5ACC;&#x306A;&#x306E;&#x300D;&#x300C;&#x4F55;&#x304C;&#x3046;&#x308B;&#x3055;&#x3044;&#x3093;&#x3060;&#x300D;&#x300C;HDD&#x304C;&#x300D;&#x300C;&#x795E;&#x7D4C;&#x8CEA;&#x3060;&#x306A;&#x300D;&#x300C;&#x3046;&#x308B;&#x3055;&#x3044;&#x306E;&#x306F;&#x5BDD;&#x3066;&#x308B;&#x3068;&#x304D;&#x3060;&#x3088;&#x300D;&#x300C;&#x96FB;&#x6E90;&#x3092;&#x5207;&#x308C;&#x3070;&#x3044;&#x3044;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x300D;&#x300C;&#x305D;&#x308C;&#x3058;&#x3083;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x306E;&#x901F;&#x3055;&#x306B;&#x52DD;&#x3066;&#x306A;&#x3044;&#x3002;&#x3060;&#x304B;&#x3089;&#x3044;&#x3064;&#x3067;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x30AB;&#x30FC;&#x30CD;&#x30EB;&#x306E;&#x66F4;&#x65B0;&#x4EE5;&#x5916;&#x3067;&#x96FB;&#x6E90;&#x306F;&#x843D;&#x3068;&#x3055;&#x306A;&#x3044;&#x3057;&#x30B9;&#x30EA;&#x30FC;&#x30D7;&#x3082;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x3044;&#x3046;&#x304C;&#xFF0C;emacs&#x306F;&#x30A8;&#x30C7;&#x30A3;&#x30BF;&#x3060;&#x308D;&#x3046;&#x300D;&#x300C;&#x79C1;&#x306F;org-mode&#x3068;yatex&#x4EE5;&#x5916;&#x306B;emacs&#x3067;&#x6587;&#x7AE0;&#x66F8;&#x3044;&#x305F;&#x3053;&#x3068;&#x304C;&#x306A;&#x3044;&#x3057;&#x3053;&#x308C;&#x304B;&#x3089;&#x3082;&#x66F8;&#x304B;&#x306A;&#x3044;&#x3002;&#x3060;&#x304B;&#x3089;emacs&#x306F;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x300D;&#x300C;&#x3058;&#x3083;&#x3042;&#x666E;&#x6BB5;&#x306A;&#x306B;&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x3084;&#x3063;&#x3066;&#x3044;&#x308B;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;RStudio&#x3068;&#x304B;MATLAB&#x3068;&#x304B;&#x3002;&#x306D;&#xFF0C;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x3084;&#x308B;&#x3063;&#x3066;&#x306A;&#x3093;&#x304B;&#x7384;&#x4EBA;&#x306A;&#x611F;&#x3058;&#x3057;&#x306A;&#x3044;&#xFF1F;&#x300E;&#x307C;&#x304B;&#x3042;&#xFF0C;&#x9152;&#x3082;&#x30BF;&#x30D0;&#x30B3;&#x3082;&#x3084;&#x3089;&#x306A;&#x3044;&#x3093;&#x3060;&#x3041;&#x300F;&#x307F;&#x305F;&#x3044;&#x306A;&#x300D;&#x300C;&#x63DA;&#x3052;&#x8DB3;&#x3092;&#x53D6;&#x308B;&#x306E;&#x306F;&#x3084;&#x3081;&#x308D;&#x3002;&#x305D;&#x308C;&#x3092;emacs&#x3067;&#x66F8;&#x3051;&#x3070;&#x3082;&#x3063;&#x3068;&#x4FBF;&#x5229;&#x306B;&#x306A;&#x308B;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x3044;&#x3063;&#x3053;emacs&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x66F8;&#x3044;&#x3066;&#x305F;&#x306E;&#x601D;&#x3044;&#x51FA;&#x3057;&#x305F;&#x300D;&#x300C;&#x4F55;&#x3060;&#x300D;&#x300C;Skyrim&#x306E;Mod&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x300D;&#x300C;&#x3042;&#xFF0C;&#x305D;&#x3046;&#x2026;&#x300D;&#x300C;papyrus-mode&#x3063;&#x3066;&#x3044;&#x3063;&#x3066;&#x300D;&#x300C;&#x3044;&#x3084;&#xFF0C;&#x3044;&#x3044;&#x300D;  </p>
<p>EeePC&#x306E;&#x53CD;&#x5BFE;&#x3092;&#x62BC;&#x3057;&#x5207;&#x3063;&#x3066;&#x79C1;&#x306F;240GB&#x306E;SSD&#x3092;&#x63DB;&#x88C5;&#x3057;&#xFF0C;&#x518D;&#x3073;Debian&#x306E;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3068;&#xFF0C;emacs&#x306E;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x3068;&#x3044;&#x3046;&#x4FEE;&#x884C;&#x3092;&#x3057;&#x305F;&#x3002;&#x306A;&#x304A;EeePC&#x306E;&#x7121;&#x7DDA;&#x30E2;&#x30B8;&#x30E5;&#x30FC;&#x30EB;&#x90E8;&#x306B;&#x53D6;&#x308A;&#x4ED8;&#x3051;&#x3089;&#x308C;&#x308B;&#x52D5;&#x753B;&#x518D;&#x751F;&#x652F;&#x63F4;&#x7528;&#x306E;&#x30C1;&#x30C3;&#x30D7;&#x304C;&#x3042;&#x308A;&#xFF0C;&#x305D;&#x308C;&#x3092;&#x4F7F;&#x3048;&#x3070;EeePC&#x3067;&#x3082;&#x30D5;&#x30EB;HD&#x306E;&#x52D5;&#x753B;&#x304C;&#x30B3;&#x30DE;&#x843D;&#x3061;&#x305B;&#x305A;&#x306B;&#x898B;&#x3089;&#x308C;&#x308B;&#x3089;&#x3057;&#x3044;&#x3002;  </p>
<p>&#x305D;&#x3057;&#x3066;&#x99C6;&#x52D5;&#x90E8;&#x306E;&#x306A;&#x3044;EeePC&#x304C;&#x8A95;&#x751F;&#x3057;&#x305F;&#x3002;&#x305F;&#x3060;&#xFF0C;&#x5E38;&#x6642;emacs&#x3092;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3044;&#x308B;&#x3060;&#x3051;&#x3067;&#xFF0C;&#x96FB;&#x6E90;&#x3082;&#x5207;&#x3089;&#x306A;&#x3044;&#x306E;&#x3067;&#x901F;&#x5EA6;&#x9762;&#x306E;&#x6069;&#x6075;&#x306F;&#x305D;&#x308C;&#x307B;&#x3069;&#x611F;&#x3058;&#x306A;&#x3044;&#x3002;  </p>
<p>&#x79C1;&#x306F;EeePC&#x306E;&#x30B5;&#x30A6;&#x30F3;&#x30C9;&#x30C7;&#x30D0;&#x30A4;&#x30B9;&#x3092;pavucontrol&#x3067;&#x5207;&#x308A;&#x66FF;&#x3048;&#x308B;&#x3068;&#xFF0C;&#x30B9;&#x30D4;&#x30FC;&#x30AB;&#x30FC;&#x304B;&#x3089;&#x97F3;&#x697D;&#x3092;&#x6D41;&#x3057;&#x3066;&#x8074;&#x3044;&#x3066;&#x307F;&#x305F;&#x3002;&#x99C6;&#x52D5;&#x90E8;&#x304C;&#x306A;&#x3044;&#x3068;&#x3053;&#x308C;&#x307B;&#x3069;&#x5FEB;&#x9069;&#x306B;&#x306A;&#x308B;&#x306A;&#x3093;&#x3066;&#x3002;&#x3044;&#x3084;&#xFF0C;&#x3082;&#x3068;&#x3082;&#x3068;&#x79C1;&#x306F;EeePC&#x306E;&#x30D5;&#x30A1;&#x30F3;&#x97F3;&#x3092;&#x304B;&#x306A;&#x308A;&#x4E0D;&#x5FEB;&#x306B;&#x601D;&#x3063;&#x3066;&#x3044;&#x305F;&#x3088;&#x3046;&#x306A;&#x3002;&#x305D;&#x308C;&#x304C;&#x6C17;&#x306B;&#x306A;&#x3063;&#x3066;&#x7D50;&#x5C40;&#x65B0;&#x3057;&#x3044;&#x30CE;&#x30FC;&#x30C8;PC&#x3092;&#x8CB7;&#x3063;&#x305F;&#x3088;&#x3046;&#x306A;&#x3002;&#x4ECA;&#x3068;&#x306A;&#x3063;&#x3066;&#x306F;&#x5B9A;&#x304B;&#x3067;&#x306F;&#x306A;&#x3044;&#x304C;&#xFF0C;&#x305D;&#x3093;&#x306A;&#x66D6;&#x6627;&#x306A;&#x8A18;&#x61B6;&#x304C;&#x3088;&#x307F;&#x304C;&#x3048;&#x3063;&#x3066;&#x304D;&#x305F;&#x3002;&#x305F;&#x3060;&#xFF0C;&#x305D;&#x308C;&#x3092;EeePC&#x306B;&#x544A;&#x3052;&#x308C;&#x3070;&#x304D;&#x3063;&#x3068;&#x6A5F;&#x5ACC;&#x3092;&#x640D;&#x306D;&#x308B;&#x3060;&#x308D;&#x3046;&#x304B;&#x3089;&#xFF0C;&#x79C1;&#x306F;&#x5FC3;&#x306E;&#x5185;&#x306B;&#x7559;&#x3081;&#x3066;&#x304A;&#x304F;&#x3053;&#x3068;&#x306B;&#x3057;&#x305F;&#x3002;  </p>
<p><br><br>&#x300C;&#x3068;&#x3053;&#x308D;&#x3067;&#x809D;&#x5FC3;&#x306E;&#x554F;&#x984C;&#x304C;&#x6E08;&#x3093;&#x3067;&#x3044;&#x306A;&#x3044;&#x304C;&#x300D;&#x300C;&#x306A;&#x306B;&#xFF1F;&#x300D;&#x300C;&#x541B;&#x306F;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x3092;&#x3069;&#x3046;&#x3059;&#x308B;&#x3064;&#x3082;&#x308A;&#x3060;&#x300D;&#x300C;SKK&#x3092;&#x4F7F;&#x3046;&#x3088;&#x300D;  </p>
<p>EeePC&#x306F;&#x300C;&#x3067;&#x305F;&#x3088;skk&#x2026;&#x300D;&#x3068;&#x3044;&#x3046;&#x8868;&#x60C5;&#x3092;&#x3057;&#x305F;&#xFF0C;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x305F;&#x3002;  </p>
<blockquote>
<p>&#x6700;&#x521D;&#x306B;&#x8A00;&#x3063;&#x3068;&#x304F;&#x3051;&#x3069;&#x3001;SKK&#x306E;&#x5909;&#x63DB;&#x65B9;&#x6CD5;&#x306F;&#x30AC;&#x30C1;&#x3067;&#x975E;&#x5E38;&#x306B;&#x72EC;&#x7279;&#x3067;&#x3042;&#x308B;&#x3002; &#x2013; <a href="https://dic.nicovideo.jp/a/skk" target="_blank">&#x30CB;&#x30B3;&#x30CB;&#x30B3;&#x5927;&#x767E;&#x79D1;&#x300E;SKK&#x300F;</a>  </p>
</blockquote>
<p>SKK&#x306F;EeePC&#x3067;&#x3082;&#x4ED6;&#x306E;PC&#x3068;&#x5909;&#x308F;&#x3089;&#x306A;&#x3044;&#x901F;&#x5EA6;&#x3067;&#x300C;&#x79C1;&#x304C;&#x300D;&#x5909;&#x63DB;&#x3067;&#x304D;&#x308B;&#xFF0C;&#x73FE;&#x72B6;&#x552F;&#x4E00;&#x306E;&#x65E5;&#x672C;&#x8A9E;&#x5165;&#x529B;&#x65B9;&#x5F0F;&#x3067;&#x3042;&#x308B;&#x3002;&#x8D85;&#x591A;&#x6BB5;&#x30B7;&#x30D5;&#x30C8;&#x3068;&#x304B;&#x7121;&#x7406;&#x3067;&#x3059;&#x3002;&#x3054;&#x3081;&#x3093;&#x306A;&#x3055;&#x3044;&#x3002;SKK&#x306F;&#x672C;&#x4F53;&#x304C;elisp&#x3067;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#xFF0C;emacs&#x304C;&#x52D5;&#x304F;&#x3068;&#x3053;&#x308D;&#x306A;&#x3089;&#x3069;&#x3053;&#x3067;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x3002;&#x4EEE;&#x306B;&#x4ECA;&#x5F8C;termux&#x3092;&#x4F7F;&#x3046;&#x3088;&#x3046;&#x306A;&#x6A5F;&#x4F1A;&#x304C;&#x3042;&#x3063;&#x3066;&#x3082;&#xFF0C;&#x3084;&#x308C;mozc&#x306E;&#x30D3;&#x30EB;&#x30C9;&#x3060;&#x306E;&#x305D;&#x3046;&#x3044;&#x3063;&#x305F;&#x624B;&#x9593;&#x304C;&#x304B;&#x304B;&#x3089;&#x305A;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x306E;&#x304C;&#x5F37;&#x307F;&#x3067;&#x3042;&#x308B;&#x3002;&#x4E88;&#x6E2C;&#x5909;&#x63DB;&#x6A5F;&#x80FD;&#x3082;&#x53E4;&#x304F;&#x304B;&#x3089;&#x5B9F;&#x88C5;&#x3055;&#x308C;&#x3066;&#x3044;&#x3066;&#xFF0C;&#x300C;&#x306B;&#x3085;&#x3046;&#x308A;&#x3087;&#x304F;&#x300D;&#x3068;&#x3044;&#x3063;&#x305F;&#xFF0C;&#x4E00;&#x3064;&#x306E;&#x6307;&#x306B;&#x8CA0;&#x8377;&#x304C;&#x304B;&#x304B;&#x308B;&#x5358;&#x8A9E;&#x3082;&#x52A9;&#x3051;&#x3066;&#x304F;&#x308C;&#x308B;&#x3002;AZIK&#x3068;&#x3044;&#x3046;&#x30ED;&#x30FC;&#x30DE;&#x5B57;&#x62E1;&#x5F35;&#x5165;&#x529B;&#x65B9;&#x5F0F;&#x306B;&#x3082;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x304A;&#x308A;&#xFF0C;&#x79C1;&#x304C;EeePC&#x3092;&#x73FE;&#x5F79;&#x306E;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3048;&#x308B;&#x3068;&#x601D;&#x3063;&#x305F;&#x306E;&#x3082;SKK&#x306E;&#x304A;&#x304B;&#x3052;&#x3067;&#x3042;&#x308B;&#x3002;&#x3042;&#x308A;&#x304C;&#x3068;&#x3046;SKK&#x958B;&#x767A;&#x8005;&#x306E;&#x7686;&#x3055;&#x3093;&#x3002;  </p>
<p>SKK&#x306E;&#x30DA;&#x30FC;&#x30B8; (<a href="http://openlab.ring.gr.jp/skk/index-j.html" target="_blank">http://openlab.ring.gr.jp/skk/index-j.html</a>)  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="03.html" class="navigation navigation-prev " aria-label="Previous page: 03 - EeePCとEmacsとセットアップと">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="05.html" class="navigation navigation-next " aria-label="Next page: 05 - EeePCとEmacsとインターネットと">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"04 - EeePCとEmacsとSSDと日本語と","level":"1.5","depth":1,"next":{"title":"05 - EeePCとEmacsとインターネットと","level":"1.6","depth":1,"path":"05.md","ref":"05.md","articles":[]},"previous":{"title":"03 - EeePCとEmacsとセットアップと","level":"1.4","depth":1,"path":"03.md","ref":"03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"04.md","mtime":"2018-07-28T21:12:52.935Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-05T11:39:57.797Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

