
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>05 - EeePCとEmacsとインターネットと · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="06.html" />
    
    
    <link rel="prev" href="04.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >05 - EeePCとEmacsとインターネットと</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="05---eeepc&#x3068;emacs&#x3068;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x3068;">05 - EeePC&#x3068;Emacs&#x3068;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x3068;</h1>
<p>&#x305D;&#x306E;&#x65E5;&#xFF0C;&#x79C1;&#x304C;&#x30DE;&#x30A6;&#x30B9;&#x3067;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3092;&#x64CD;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#xFF0C;EeePC&#x304C;&#x805E;&#x3044;&#x3066;&#x304D;&#x305F;&#x3002;&#x3053;&#x308C;&#x307E;&#x3067;&#x5411;&#x3053;&#x3046;&#x304B;&#x3089;&#x8A71;&#x3057;&#x304B;&#x3051;&#x3066;&#x304F;&#x308B;&#x3053;&#x3068;&#x306A;&#x3069;&#x306A;&#x304B;&#x3063;&#x305F;&#x306E;&#x3060;&#x304C;&#xFF0C;&#x79C1;&#x306B;&#x5FC3;&#x3092;&#x2026;&#x5FC3;&#xFF1F;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306B;&#x5FC3;&#xFF1F;&#x3068;&#x306B;&#x304B;&#x304F;&#xFF0C;&#x958B;&#x3044;&#x3066;&#x304F;&#x308C;&#x305F;&#x306E;&#x3060;&#x308D;&#x3046;&#x304B;&#x3002;  </p>
<p>&#x300C;&#x541B;&#x306F;&#x6642;&#x3005;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306A;&#x3002;&#x305D;&#x308C;&#x306A;&#x3089;&#x4ED6;&#x306E;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x3067;&#x826F;&#x304B;&#x3063;&#x305F;&#x3093;&#x3058;&#x3083;&#x306A;&#x3044;&#x306E;&#x304B;&#x300D;  </p>
<p>&#x300C;&#x3053;&#x308C;&#x306F;&#x79C1;&#x306E;&#x6587;&#x7AE0;&#x304C;&#x3069;&#x3046;&#x898B;&#x3048;&#x308B;&#x304B;&#x78BA;&#x304B;&#x3081;&#x308B;&#x305F;&#x3081;&#x3060;&#x3088;&#x3002;&#x666E;&#x6BB5;&#x306F;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x666E;&#x6BB5;&#x306F;&#xFF1F;&#x2026;&#x3042;&#x3042;&#xFF0C;&#x666E;&#x6BB5;&#x306F;eww&#x304B;&#x300D;  </p>
<p>eww &#x2013; emacs web wowser&#x3002;emacs&#x306B;&#x6A19;&#x6E96;&#x3067;&#x3064;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x3042;&#x308B;&#x3002;  </p>
<p>&#x79C1;&#x306F;eww&#x3067;&#x691C;&#x7D22;&#x3092;&#x3057;&#x3066;&#x307F;&#x305B;&#x305F;&#x3002;duckduckgo&#x3060;&#x3068;&#x691C;&#x7D22;&#x7D50;&#x679C;&#x304C;&#x898B;&#x3065;&#x3089;&#x3044;&#x306E;&#x3067;google&#x3092;&#x4F7F;&#x3046;&#x3088;&#x3046;&#x8A2D;&#x5B9A;&#x3092;&#x5909;&#x3048;&#x3066;&#x3042;&#x308B;&#x3002;  </p>
<p><img src="images/03.png" alt="eww-screen">  </p>
<p>&#x300C;&#x901F;&#x3044;&#x306A;&#x300D;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;&#x540D;&#x306E;&#x3068;&#x304A;&#x308A;&#xFF0C;&#x672C;&#x5F53;&#x306B;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x306E;&#x307F;&#x3067;&#x3042;&#x308B;&#x3002;&#x3086;&#x3048;&#x306B;&#x5727;&#x5012;&#x7684;&#x306B;&#x901F;&#x3044;&#x3002;  </p>
<p>&#x300C;&#x3067;&#x3082;&#x963F;&#x90E8;&#x5BDB;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x30DA;&#x30FC;&#x30B8;&#x304C;&#x898B;&#x308C;&#x306A;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x308C;&#x306F;&#x5B9F;&#x306B;&#x6B8B;&#x5FF5;&#x3060;&#x300D;  </p>
<p>&#x963F;&#x90E8;&#x5BDB;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x30DA;&#x30FC;&#x30B8;&#x306F;table&#x30BF;&#x30B0;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x304A;&#x308A;&#xFF0C;eww&#x304C;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x305F;&#x3081;&#xFF0C;&#x6B63;&#x3057;&#x304F;&#x8868;&#x793A;&#x3055;&#x308C;&#x306A;&#x3044;&#x306E;&#x3060;&#x3002;  </p>
<p>&#x300C;&#x78BA;&#x304B;eww&#x306F;&#x753B;&#x50CF;&#x8868;&#x793A;&#x3082;&#x3067;&#x304D;&#x305F;&#x306F;&#x305A;&#x3060;&#x304C;&#x300D;&#x300C;nov.el&#x3092;&#x5165;&#x308C;&#x308C;&#x3070;epub&#x3082;&#x8AAD;&#x3081;&#x308B;&#x3088;&#x300D;&#x300C;&#x3075;&#x3080;&#x3002;&#x3060;&#x3068;&#x3059;&#x308B;&#x3068;&#x306A;&#x305C;&#x3053;&#x3053;&#x3067;&#x306F;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x3093;&#x3060;&#xFF1F;&#x300D;&#x300C;&#x30EC;&#x30A4;&#x30A2;&#x30A6;&#x30C8;&#x304C;&#x5D29;&#x308C;&#x308B;&#x3057;&#x91CD;&#x3044;&#x304B;&#x3089;&#x975E;&#x8868;&#x793A;&#x306B;&#x3057;&#x3066;&#x308B;&#x3002;gif&#x304C;&#x3042;&#x308B;&#x30DA;&#x30FC;&#x30B8;&#x3060;&#x3068;&#x91CD;&#x304F;&#x306A;&#x308B;&#x3057;&#x300D;  </p>
<p>eww&#x306F;gif&#x30A2;&#x30CB;&#x30E1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x308F;&#x308A;&#xFF0C;&#x7570;&#x69D8;&#x306B;&#x91CD;&#x304F;&#x306A;&#x308B;&#x3068;&#x3044;&#x3046;&#x6B20;&#x70B9;&#x304C;&#x3042;&#x308B;&#x3002;&#x3060;&#x304B;&#x3089;&#x666E;&#x6BB5;&#x306F;&#x975E;&#x8868;&#x793A;&#x306B;&#x3057;&#x3066;&#x304A;&#x3044;&#x3066;&#xFF0C;&#x753B;&#x50CF;&#x306F;&#x5FC5;&#x8981;&#x306B;&#x5FDC;&#x3058;&#x3066;&#x95B2;&#x89A7;&#x3059;&#x308B;&#x3002;  </p>
<p>&#x300C;eww&#x3092;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x306F;&#x308F;&#x304B;&#x3063;&#x305F;&#x3002;&#x305D;&#x308C;&#x306B;&#x304F;&#x3089;&#x3079;&#x3066;&#x3053;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306F;&#x4F55;&#x3060;&#x300D;&#x300C;Vivaldi&#x306E;&#x3053;&#x3068;&#xFF1F;&#x300D;&#x300C;&#x672C;&#x5F53;&#x306B;&#x9045;&#x3044;&#x306A;&#x300D;&#x300C;&#x5931;&#x793C;&#x306A;&#x3002;&#x9045;&#x3044;&#x306E;&#x306F;&#x541B;&#x306E;&#x305B;&#x3044;&#x3060;&#x3088;&#x300D;&#x300C;&#x3046;&#x30FC;&#x3080;&#x3002;&#x6211;&#x306A;&#x304C;&#x3089;&#x3058;&#x308C;&#x3063;&#x305F;&#x304F;&#x306A;&#x308B;&#x300D;&#x300C;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x5104;&#x52AB;&#x306B;&#x306A;&#x3063;&#x3066;&#x3053;&#x306A;&#x3044;&#xFF1F;&#x300D;&#x300C;&#x78BA;&#x304B;&#x306B;&#x300D;&#x300C;&#x3060;&#x304B;&#x3089;&#x541B;&#x3092;&#x4F7F;&#x3046;&#x3093;&#x3060;&#x3088;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3046;&#x304B;&#x3002;&#x305D;&#x3046;&#x3044;&#x3046;&#x3053;&#x3068;&#x304B;&#x300D;EeePC&#x306F;&#x3088;&#x3046;&#x3084;&#x304F;&#x81EA;&#x5206;&#x306E;&#x5F79;&#x5272;&#x3092;&#x7406;&#x89E3;&#x3057;&#x305F;&#x3088;&#x3046;&#x3060;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x30D6;&#x30E9;&#x30A6;&#x30B8;&#x30F3;&#x30B0;&#x306E;&#x30B9;&#x30C8;&#x30EC;&#x30B9;&#x3092;&#x4E0B;&#x3052;&#x308B;&#x305F;&#x3081;&#x306B;&#x4E16;&#x754C;&#x4E2D;&#x306E;IT&#x6280;&#x8853;&#x8005;&#x304C;&#x65E5;&#x591C;&#x8840;&#x306E;&#x306B;&#x3058;&#x3080;&#x3088;&#x3046;&#x306A;&#x52AA;&#x529B;&#x3092;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x3060;&#x304C;&#x5FEB;&#x9069;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x3066;&#x3057;&#x307E;&#x3046;&#x3068;&#xFF0C;&#x3064;&#x3044;&#x3064;&#x3044;&#x4E0D;&#x8981;&#x306A;&#x30DA;&#x30FC;&#x30B8;&#x3082;&#x898B;&#x3066;&#x3057;&#x307E;&#x3046;&#x3002;&#x6C34;&#x304C;&#x9AD8;&#x3044;&#x6240;&#x304B;&#x3089;&#x4F4E;&#x3044;&#x6240;&#x3078;&#x6D41;&#x308C;&#x3066;&#x3044;&#x304F;&#x3088;&#x3046;&#x306B;&#xFF0C;&#x3084;&#x304C;&#x3066;&#x5E03;&#x56E3;&#x306E;&#x4E2D;&#x3067;&#x3055;&#x3048;&#x3082;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x306B;&#x306E;&#x3081;&#x308A;&#x3053;&#x3093;&#x3067;&#x3057;&#x307E;&#x3046;&#x3002;&#x305D;&#x308C;&#x3092;&#x65AD;&#x3061;&#x5207;&#x308B;&#x305F;&#x3081;&#x306B;&#x30AD;&#x30F3;&#x30B0;&#x30B8;&#x30E0;&#x793E;&#x306E;&#x30DD;&#x30E1;&#x30E9;&#x304C;&#x4E16;&#x754C;&#x4E2D;&#x3067;&#x5927;&#x6D3B;&#x8E8D;&#x3057;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x306F;&#x8AB0;&#x3082;&#x304C;&#x77E5;&#x308B;&#x3068;&#x3053;&#x308D;&#x3067;&#x3042;&#x308B;&#x304C;&#xFF0C;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x3092;&#x7D76;&#x3064;&#x3068;&#xFF0C;&#x4E9B;&#x7D30;&#x306A;&#x691C;&#x7D22;&#x3055;&#x3048;&#x3082;&#x3067;&#x304D;&#x306A;&#x304F;&#x306A;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x3002;&#x79C1;&#x304C;EeePC&#x306B;&#x6C42;&#x3081;&#x305F;&#x300C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;&#x3064;&#x3044;&#x305F;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x300D;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#xFF0C;&#x300C;tips&#x7A0B;&#x5EA6;&#x306E;&#x4E9B;&#x7D30;&#x306A;&#x691C;&#x7D22;&#x3092;&#x8A31;&#x5BB9;&#x3057;&#x3064;&#x3064;&#xFF0C;&#x306E;&#x3081;&#x308A;&#x3053;&#x3081;&#x308B;&#x307B;&#x3069;&#x306F;&#x9B45;&#x529B;&#x7684;&#x3067;&#x306A;&#x3044;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x74B0;&#x5883;&#x3092;&#x6301;&#x3064;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x300D;&#x3067;&#x3042;&#x3063;&#x305F;&#x3002;  </p>
<p>&#x305F;&#x3068;&#x3048;&#x3070;&#xFF0C;&#x3069;&#x3046;&#x3057;&#x3066;&#x3082;&#x898B;&#x305F;&#x3044;&#x30DA;&#x30FC;&#x30B8;&#xFF0C;note&#x3084;medium&#x306A;&#x3069;&#xFF0C;Javascript&#x304C;&#x306A;&#x3044;&#x3068;&#x8868;&#x793A;&#x3055;&#x308C;&#x306A;&#x3044;&#x30DA;&#x30FC;&#x30B8;&#x3084;&#x30D7;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x306E;&#x969B;&#x306F;&#x901A;&#x5E38;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3092;&#x4F7F;&#x3046;&#x304C;&#xFF0C;&#x3068;&#x3066;&#x3082;&#x5E38;&#x7528;&#x306B;&#x306F;&#x8010;&#x3048;&#x306A;&#x3044;&#x3057;&#xFF0C;&#x305D;&#x3046;&#x3044;&#x3063;&#x305F;&#x30DA;&#x30FC;&#x30B8;&#x306A;&#x3089;&#x30B9;&#x30DE;&#x30DB;&#x3084;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x3067;&#x898B;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;&#x305F;&#x3060;&#x305D;&#x308C;&#x3060;&#x3051;&#x3067;&#x7559;&#x3081;&#x3089;&#x308C;&#x308C;&#x3070;&#x3088;&#x3044;&#x304C;&#x3002;  </p>
<p>&#x300C;&#x3067;&#x306F;&#x691C;&#x7D22;&#x306F;eww&#x3067;&#x3059;&#x308B;&#x3068;&#x3057;&#x3066;&#xFF0C;github&#x306F;&#x3069;&#x3046;&#x3084;&#x3063;&#x3066;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x3093;&#x3060;&#x300D;&#x300C;magit&#x3068;&#x304B;magithub&#x304C;&#x3042;&#x308B;&#x3088;&#x300D;&#x300C;&#x30E1;&#x30FC;&#x30EB;&#x306F;&#x300D;&#x300C;mew&#x300D;&#x300C;twitter&#x306F;&#x300D;&#x300C;twit&#x300D;&#x300C;&#x5168;&#x7136;&#x898F;&#x5236;&#x3067;&#x304D;&#x3066;&#x306A;&#x3044;&#x3058;&#x3083;&#x306A;&#x3044;&#x304B;&#x3002;&#x3058;&#x3083;&#x3042;Instagram&#x306F;&#x3002;Reddit&#x306F;&#x3002;Slack&#x306F;&#x300D;&#x300C;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3068;&#x3057;&#x3066;&#x4F7F;&#x304A;&#x3046;&#x3068;&#x3057;&#x3066;&#x308B;&#x3093;&#x3060;&#x304B;&#x3089;&#x305D;&#x3053;&#x307E;&#x3067;&#x6C42;&#x3081;&#x306A;&#x3044;&#x3067;&#x3088;&#x300D;  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="04.html" class="navigation navigation-prev " aria-label="Previous page: 04 - EeePCとEmacsとSSDと日本語と">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="06.html" class="navigation navigation-next " aria-label="Next page: 06 - EeePCとEmacsと私の大切なアシスタント">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"05 - EeePCとEmacsとインターネットと","level":"1.6","depth":1,"next":{"title":"06 - EeePCとEmacsと私の大切なアシスタント","level":"1.7","depth":1,"path":"06.md","ref":"06.md","articles":[]},"previous":{"title":"04 - EeePCとEmacsとSSDと日本語と","level":"1.5","depth":1,"path":"04.md","ref":"04.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"05.md","mtime":"2018-08-05T03:06:53.812Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-05T03:12:54.214Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

