
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>06 - EeePCとEmacsと私の大切なアシスタント · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="07.html" />
    
    
    <link rel="prev" href="05.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    EeePCとEmacsと○○と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="01.html">
            
                <a href="01.html">
            
                    
                    01 - EeePCとEmacsと私と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="02.html">
            
                <a href="02.html">
            
                    
                    02 - EeePCとEmacsとLinuxと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="03.html">
            
                <a href="03.html">
            
                    
                    03 - EeePCとEmacsとセットアップと
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="04.html">
            
                <a href="04.html">
            
                    
                    04 - EeePCとEmacsとSSDと日本語と
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="05.html">
            
                <a href="05.html">
            
                    
                    05 - EeePCとEmacsとインターネットと
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="06.html">
            
                <a href="06.html">
            
                    
                    06 - EeePCとEmacsと私の大切なアシスタント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="07.html">
            
                <a href="07.html">
            
                    
                    おまけ - EeePCとEmacsとEXWMと
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >06 - EeePCとEmacsと私の大切なアシスタント</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="06---eeepc&#x3068;emacs&#x3068;&#x79C1;&#x306E;&#x5927;&#x5207;&#x306A;&#x30A2;&#x30B7;&#x30B9;&#x30BF;&#x30F3;&#x30C8;">06 - EeePC&#x3068;Emacs&#x3068;&#x79C1;&#x306E;&#x5927;&#x5207;&#x306A;&#x30A2;&#x30B7;&#x30B9;&#x30BF;&#x30F3;&#x30C8;</h1>
<p>&#x666E;&#x901A;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x306F;&#x30D6;&#x30ED;&#x30B0;&#x3092;&#x958B;&#x304F;&#x3060;&#x3051;&#x3067;&#x3082;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x304C;&#x3082;&#x305F;&#x3064;&#x304F;&#x3002;&#x3055;&#x3059;&#x304C;&#x306B;&#x963F;&#x90E8;&#x5BDB;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x30DA;&#x30FC;&#x30B8;&#x306F;&#x901F;&#x3044;&#x3002;&#x3060;&#x304C;&#x305D;&#x306E;&#x524D;&#x304C;&#x554F;&#x984C;&#x3060;&#x3002;&#x963F;&#x90E8;&#x5BDB;&#x306E;&#x30DB;&#x30FC;&#x30E0;&#x30DA;&#x30FC;&#x30B8;&#x3092;Google&#x3084;Bing&#x3067;&#x691C;&#x7D22;&#x3059;&#x308B;&#x306E;&#x306F;&#x305F;&#x3081;&#x3089;&#x308F;&#x3089;&#x308C;&#x308B;&#x307B;&#x3069;&#xFF0C;&#x691C;&#x7D22;&#x7D50;&#x679C;&#x306E;&#x8868;&#x793A;&#x306B;&#x6642;&#x9593;&#x304C;&#x304B;&#x304B;&#x308B;&#x306E;&#x3060;&#x3002;  </p>
<p>&#x305D;&#x306E;&#x69D8;&#x5B50;&#x3092;&#x898B;&#x306A;&#x304C;&#x3089;&#xFF0C;EeePC&#x306F;&#x6614;&#x306E;&#x81EA;&#x5206;&#x3068;&#x6BD4;&#x8F03;&#x3057;&#x3066;&#x3044;&#x305F;&#x3088;&#x3046;&#x3060;&#x3002;&#x300C;&#x4ECA;&#x306E;youtube&#x306F;&#x7121;&#x7406;&#x305D;&#x3046;&#x3060;&#x306A;&#x3002;&#x6614;&#x306F;&#x826F;&#x304F;&#x898B;&#x305F;&#x3082;&#x306E;&#x3060;&#x304C;&#x300D;&#x300C;mpv&#x4F7F;&#x3048;&#x3070;&#x4ECA;&#x3067;&#x3082;&#x898B;&#x308C;&#x308B;&#x3051;&#x3069;&#xFF0C;&#x305F;&#x3076;&#x3093;&#x4F7F;&#x308F;&#x306A;&#x3044;&#x300D;&#x300C;&#x898B;&#x308C;&#x308B;&#x306E;&#x304B;&#x300D;&#x300C;&#x898B;&#x308C;&#x308B;&#x3088;&#x300D;&#x300C;&#x898B;&#x3066;&#x3082;&#x3044;&#x3044;&#x304B;&#x300D;  </p>
<p>&#x305D;&#x308C;&#x306F;&#x304B;&#x3064;&#x3066;&#x5F53;&#x7136;&#x306E;&#x3088;&#x3046;&#x306B;&#x3067;&#x304D;&#x3066;&#x3044;&#x305F;&#x3053;&#x3068;&#x3060;&#x3002;&#x3060;&#x304C;&#x4ECA;&#xFF0C;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;youtube&#x3092;&#x958B;&#x3044;&#x3066;&#x3082;&#x30B3;&#x30DE;&#x843D;&#x3061;&#x304C;&#x3072;&#x3069;&#x304F;&#x898B;&#x3089;&#x308C;&#x305F;&#x3082;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x305D;&#x306E;&#x73FE;&#x5B9F;&#x3092;&#x3064;&#x304D;&#x3064;&#x3051;&#x305F;&#x304F;&#x306F;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;&#x3068;&#x306F;&#x3044;&#x3048;Xiph&#x306A;&#x3069;&#x3067;&#x914D;&#x5E03;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x306A;&#x30C6;&#x30B9;&#x30C8;&#x52D5;&#x753B;&#x3067;&#x304A;&#x8336;&#x3092;&#x6FC1;&#x3059;&#x306E;&#x3082;&#x305F;&#x3081;&#x3089;&#x308F;&#x308C;&#x308B;&#x3002;  </p>
<p>&#x79C1;&#x306F;&#xFF0C;&#x30BF;&#x30FC;&#x30DF;&#x30CA;&#x30EB;&#x3067;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x6253;&#x3061;&#x8FBC;&#x3093;&#x3060;&#x3002;  </p>
<p>mpv <a href="https://upload.wikimedia.org/wikipedia/commons/1/17/Experience_ubuntu.ogv" target="_blank">https://upload.wikimedia.org/wikipedia/commons/1/17/Experience_ubuntu.ogv</a>  </p>
<p>&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x304C;&#x958B;&#x304B;&#x308C;&#xFF0C;&#x308F;&#x305A;&#x304B;&#x6570;&#x79D2;&#x305F;&#x3089;&#x305A;&#x3002;EeePC&#x306F;&#x7D76;&#x53E5;&#x3057;&#x305F;&#x3002;&#x8868;&#x793A;&#x3055;&#x308C;&#x305F;&#x306E;&#x306F;&#xFF0C;&#x521D;&#x671F;&#x306E;Ubuntu&#x306B;&#x540C;&#x68B1;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#xFF0C;&#x30CD;&#x30EB;&#x30BD;&#x30F3;&#x30FB;&#x30DE;&#x30F3;&#x30C7;&#x30E9;&#x6C0F;&#x3078;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30D3;&#x30E5;&#x30FC;&#x52D5;&#x753B;&#x3067;&#x3042;&#x308B;&#x3002;Ubuntu&#x306E;&#x9B42;&#x304C;&#x8FBC;&#x3081;&#x3089;&#x308C;&#x305F;&#x5091;&#x4F5C;&#x4E2D;&#x306E;&#x5091;&#x4F5C;&#x3060;&#x3002;EeePC&#x3067;&#x3082;&#x30B3;&#x30DE;&#x843D;&#x3061;&#x3057;&#x306A;&#x3044;&#x3002;&#x305F;&#x3060;&#xFF0C;&#x3053;&#x306E;&#x52D5;&#x753B;&#x306F;10&#x5E74;&#x4EE5;&#x4E0A;&#x524D;&#x306E;&#x3082;&#x306E;&#x3060;&#x3002;&#x300C;&#x3053;&#x306E;&#x52D5;&#x753B;&#x3059;&#x3054;&#x3044;&#x3088;&#x300D;&#x3068;&#x8EFD;&#x3044;&#x6C17;&#x6301;&#x3061;&#x3067;&#x898B;&#x308B;&#x3088;&#x3046;&#x306A;&#x5185;&#x5BB9;&#x3067;&#x3082;&#x306A;&#x3044;&#x3002;&#x305D;&#x308C;&#x307E;&#x3067;&#x306E;&#x7A7A;&#x6C17;&#x304C;&#x6025;&#x6FC0;&#x306B;&#x3057;&#x3089;&#x3051;&#x3066;&#x3086;&#x304F;&#x3002;  </p>
<p>&#x300C;&#x306D;&#xFF0C;&#x898B;&#x308C;&#x308B;&#x3067;&#x3057;&#x3087;&#x300D;  </p>
<p>&#x300C;&#x2026;&#x541B;&#x306F;&#x79C1;&#x3092;&#x3053;&#x3093;&#x306A;&#x76EE;&#x306B;&#x3042;&#x308F;&#x305B;&#x3066;&#x697D;&#x3057;&#x3044;&#x306E;&#x304B;&#xFF1F;&#x300D;  </p>
<p>EeePC&#x306F;&#x81EA;&#x5206;&#x304C;&#x4FAE;&#x8FB1;&#x3055;&#x308C;&#x305F;&#x3068;&#x611F;&#x3058;&#x305F;&#x306E;&#x3060;&#x308D;&#x3046;&#x3002;&#x672C;&#x5F53;&#x3060;&#x3063;&#x305F;&#x3089;&#xFF0C;&#x4EBA;&#x6C17;&#x6B4C;&#x624B;&#x306E;&#x30DF;&#x30E5;&#x30FC;&#x30B8;&#x30C3;&#x30AF;&#x30D3;&#x30C7;&#x30AA;&#x3084;&#xFF0C;&#x30B2;&#x30FC;&#x30E0;&#x306E;&#x30C8;&#x30EC;&#x30FC;&#x30E9;&#x30FC;&#x3068;&#x3044;&#x3063;&#x305F;&#x3082;&#x306E;&#x3092;&#x898B;&#x3066;&#xFF0C;&#x304B;&#x3064;&#x3066;&#x306E;&#x8F1D;&#x304D;&#x3092;&#x611F;&#x3058;&#x305F;&#x304B;&#x3063;&#x305F;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x6614;&#x306E;&#x79C1;&#x3092;&#x306A;&#x3050;&#x3055;&#x3081;&#xFF0C;&#x305D;&#x3057;&#x3066;&#x52B1;&#x307E;&#x3057;&#x305F;&#x3088;&#x3046;&#x306B;&#x3002;  </p>
<p>&#x3060;&#x304C;EeePC&#x3067;&#x306F;&#x3082;&#x306F;&#x3084;&#x4ECA;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x3092;&#x81EA;&#x7531;&#x306B;&#x52D5;&#x304D;&#x56DE;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3053;&#x306E;&#x30DD;&#x30F3;&#x30B3;&#x30C4;&#x3092;&#x30BF;&#x30D6;&#x30EC;&#x30C3;&#x30C8;&#x3084;&#x30B9;&#x30DE;&#x30DB;&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B;&#x4F7F;&#x3046;&#x306B;&#x306F;&#x3042;&#x307E;&#x308A;&#x306B;&#x7121;&#x529B;&#x3060;&#x304B;&#x3089;&#x3060;&#x3002;  </p>
<p>&#x3067;&#x306F;EeePC&#x304C;&#x5F79;&#x7ACB;&#x305F;&#x305A;&#x304B;&#x3068;&#x3044;&#x3048;&#x3070;&#x305D;&#x3046;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x3060;&#x3063;&#x3066;&#xFF0C;&#x4ECA;&#x306E;EeePC&#x306B;&#x306F;&#xFF0C;youtube&#x3067;&#x52D5;&#x753B;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x3088;&#x308A;&#x3082;&#x3082;&#x3063;&#x3068;&#x5927;&#x4E8B;&#x306A;&#x5F79;&#x5272;&#x304C;&#x3042;&#x308B;&#x306E;&#x3060;&#x304B;&#x3089;&#x3002;  </p>
<p>&#x305D;&#x308C;&#x306F;<a href="https://youtu.be/VADudzQGvU8?t%3D24m" target="_blank">&#x6587;&#x7AE0;&#x3092;&#x8AAD;&#x307F;&#xFF0C;&#x305D;&#x3057;&#x3066;&#x66F8;&#x304F;&#x3053;&#x3068;</a>&#x3002;  </p>
<p>&#x305D;&#x308C;&#x306F;&#x79C1;&#x3068;&#x51FA;&#x4F1A;&#x3063;&#x305F;&#x3042;&#x306E;&#x9803;&#x304B;&#x3089;&#xFF0C;&#x3044;&#x3084;&#xFF0C;&#x79C1;&#x304C;&#x521D;&#x3081;&#x3066;&#x30B3;&#x30F3;&#x30D4;&#x30E5;&#x30FC;&#x30BF;&#x306B;&#x89E6;&#x3063;&#x305F;&#x3068;&#x304D;&#x304B;&#x3089;&#x305A;&#x3063;&#x3068;&#x6C42;&#x3081;&#x3066;&#x3044;&#x305F;&#x3082;&#x306E;&#x3060;&#x3002;&#x305D;&#x3057;&#x3066;&#x305D;&#x308C;&#x306F;&#xFF0C;&#x3053;&#x308C;&#x304B;&#x3089;&#x3082;&#x304D;&#x3063;&#x3068;&#x5909;&#x308F;&#x3089;&#x306A;&#x3044;&#x3002;  </p>
<p><br><br>&#x300C;&#x697D;&#x3057;&#x3044;&#x3088;&#x3002;&#x3059;&#x3054;&#x304F;&#x697D;&#x3057;&#x3044;&#x300D;  </p>
<p>&#x300C;&#x3048;&#xFF1F;&#x300D;&#x300C;&#x4ECA;&#x3067;&#x3082;&#x3053;&#x3093;&#x306A;&#x3075;&#x3046;&#x306B;&#x541B;&#x3092;&#x4F7F;&#x3048;&#x308B;&#x306A;&#x3093;&#x3066;&#x601D;&#x3063;&#x3066;&#x306A;&#x304B;&#x3063;&#x305F;&#x304B;&#x3089;&#x300D;  </p>
<p>&#x3060;&#x304B;&#x3089;&#xFF0C;&#x79C1;&#x306F;&#x697D;&#x3057;&#x304F;&#x3066;&#x4ED5;&#x65B9;&#x304C;&#x306A;&#x3044;&#x3093;&#x3060;&#x3002;  </p>
<p>&#x300C;&#x2026;&#x305D;&#x3046;&#x304B;&#x3002;&#x541B;&#x304C;&#x697D;&#x3057;&#x3044;&#x306E;&#x306A;&#x3089;&#xFF0C;&#x305D;&#x308C;&#x3067;&#x3044;&#x3044;&#x300D;  </p>
<p><br><br><br><br>&#x3053;&#x3046;&#x3057;&#x3066;&#x79C1;&#x306F;&#x81EA;&#x5206;&#x306E;&#x8003;&#x3048;&#x305F;&#x30A2;&#x30A4;&#x30C7;&#x30A2;&#x306E;&#x5168;&#x3066;&#x3092;EeePC&#x306B;&#x898B;&#x305B;&#x305F;&#x3002;  </p>
<p>&#x300C;&#x3075;&#x30FC;&#x3080;&#x300D;  </p>
<p>&#x300C;&#x3069;&#x3046;&#xFF1F;&#x3061;&#x3083;&#x3093;&#x3068;&#x4F7F;&#x3048;&#x308B;&#x3067;&#x3057;&#x3087;&#xFF1F;&#x304B;&#x3063;&#x3053;&#x3088;&#x304F;&#x306A;&#x3044;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;Linux&#x306E;&#x64CD;&#x4F5C;&#x3092;&#x82E6;&#x3068;&#x305B;&#x305A;&#xFF0C;emacs&#x3067;&#x5927;&#x62B5;&#x306E;&#x3053;&#x3068;&#x3092;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#xFF0C;&#x3057;&#x304B;&#x3082;SKK&#x304C;&#x4F7F;&#x3048;&#x306A;&#x304D;&#x3083;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002;&#x304B;&#x306A;&#x308A;&#x306E;&#x7269;&#x597D;&#x304D;&#x3058;&#x3083;&#x306A;&#x3044;&#x3068;&#x79C1;&#x3092;&#x73FE;&#x5F79;&#x3067;&#x4F7F;&#x3046;&#x306E;&#x306F;&#x56F0;&#x96E3;&#x3060;&#xFF0C;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x306F;&#x308F;&#x304B;&#x3063;&#x305F;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3093;&#x306A;&#x5909;&#x308F;&#x3063;&#x3066;&#x308B;&#x304B;&#x306A;&#x3002;&#x666E;&#x901A;&#x3067;&#x3057;&#x3087;&#x3002;emacs&#x4F7F;&#x3048;&#x308B;&#x4EBA;&#x306A;&#x3089;Linux&#x3068;&#x304B;SKK&#x3082;&#x4F7F;&#x3048;&#x305D;&#x3046;&#x306B;&#x601D;&#x3048;&#x308B;&#x3051;&#x3069;&#x300D;  </p>
<p>&#x300C;&#x3067;&#x3082;&#x79C1;&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x306F;&#x3057;&#x306A;&#x3044;&#x306E;&#x3060;&#x308D;&#x3046;&#xFF1F;&#x300D;  </p>
<p>&#x300C;&#x3046;&#x3093;&#x3002;&#x3060;&#x3063;&#x3066;&#x30EF;&#x30FC;&#x30D7;&#x30ED;&#x3060;&#x3057;&#x300D;  </p>
<p>&#x300C;&#x305D;&#x3053;&#x306F;&#x8B72;&#x3089;&#x306A;&#x3044;&#x306E;&#x3060;&#x306A;&#x300D;  </p>
<p>&#x300C;&#x8B72;&#x3089;&#x306A;&#x3044;&#x3088;&#x300D;  </p>
<p><br><br><img src="images/04.png" alt="debian-fetch">  </p>
<p><br><br><br><br>&#x2013; &#x4E86; &#x2013;  </p>
<p><br><br><br><br><br><br><br><br>(&#x53C2;&#x8003;) &#x521D;&#x671F;&#x306E;Ubuntu&#x306B;&#x540C;&#x68B1;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x30A4;&#x30F3;&#x30BF;&#x30D3;&#x30E5;&#x30FC;&#x52D5;&#x753B;&#x306E;&#x69D8;&#x5B50;&#x3002;&#x3053;&#x306E;&#x753B;&#x50CF;&#x3092;&#x672C;&#x6587;&#x4E2D;&#x306B;&#x8868;&#x793A;&#x3057;&#x305F;&#x3068;&#x304D;&#xFF0C;&#x3042;&#x307E;&#x308A;&#x306E;&#x30A4;&#x30F3;&#x30D1;&#x30AF;&#x30C8;&#x306B;&#x305D;&#x306E;&#x5F8C;&#x306E;&#x6587;&#x7AE0;&#x304C;&#x982D;&#x306B;&#x5165;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x305F;&#x3081;&#x672B;&#x5C3E;&#x306B;&#x79FB;&#x3057;&#x305F;&#x3002;  </p>
<p><img src="images/mandela.png" alt="Experience-ubuntu">  </p>
<p>(<a href="https://en.wikipedia.org/wiki/File:Experience_ubuntu.ogv" target="_blank">https://en.wikipedia.org/wiki/File:Experience_ubuntu.ogv</a>)  </p>
<p>(&#x53C2;&#x8003;2) The Editor of a Lifetime <a href="https://www.youtube.com/watch?v=VADudzQGvU8" target="_blank">https://www.youtube.com/watch?v=VADudzQGvU8</a>  </p>
<p><br><br><br><br>(c) 2018 jamcha (jamcha.aa@gmail.com).  </p>
<p><img src="https://i.creativecommons.org/l/by-sa/4.0/88x31.png" alt="cc by-sa">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="05.html" class="navigation navigation-prev " aria-label="Previous page: 05 - EeePCとEmacsとインターネットと">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="07.html" class="navigation navigation-next " aria-label="Next page: おまけ - EeePCとEmacsとEXWMと">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"06 - EeePCとEmacsと私の大切なアシスタント","level":"1.7","depth":1,"next":{"title":"おまけ - EeePCとEmacsとEXWMと","level":"1.8","depth":1,"path":"07.md","ref":"07.md","articles":[]},"previous":{"title":"05 - EeePCとEmacsとインターネットと","level":"1.6","depth":1,"path":"05.md","ref":"05.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["back-to-top-button"],"pluginsConfig":{"back-to-top-button":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"06.md","mtime":"2018-08-05T03:07:32.267Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-08-05T03:12:54.214Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

